{"https://www.instagram.com/p/CyoRj3AO9KV/": {"timestamp": "2023-10-20T17:40:05.000Z", "comments": ["En donde está esa tienda", "😢", "shorty this is my local target", "Everyone talking about how cool this is, imagine how much cooler it would be if it were still an amazing old theatre....if a giant corporation didn't scoop it up and instead let someone else buy it and restore it back to a theatre 🤔", "@ichou_nyc", "So sad that we can no longer order in canada after being so in love with your stores…", "@megastar15", "😍😍😍", "😍 ⚡️🌟⚡️ 😍", "Target 🎯 for the Win 🥇", "I thought some of the targets in Lod Angeles were weird", "@jenniferdonia71 have you been to this target?", "That's so fancy!!!!! Love 💘 it 🎯", "My old block!", "Ok @meg_indy I see you being posted by Target WHAT😍", "Wowwww this is right near me my husband and I go every week this is also the area I grew up. Its so crazy and awesome to see an influencer here no one from our social media circles are ever here. Have a beautiful day! ❤️", "Not yet lol", "@simplyarelys  it's a small world, after all 🫶", "@targetredbasket  fancy is my middle name", "COME TO SPAIN PLEASE PLEASE WE NEED YOU", "awesome!!", "Cool but why don’t to have shops in small rural towns?", "Brooklyn is brooklynin’", "So there used to be a community center, and now it's just another pile of capitalist junk?", "I remember the theater well used to go there in the 70s to watch Italian movies with my mom and dad  The neighborhood was fantastic I wish I could do it all over again", "can i have a raise", "@kell_kendall  never a dull moment", "omg isn't this the cutest Target ever?!!!", "@ultabeauty  blushing in the theater rn ☺️", "No, you're fired", "@_kai_monty__ aw man :(", "So basic women can feel cultured", "@kookykitty190 Come to Staten Island we have two full-size Targets, prices are cheaper than Brooklyn", "That target sucks they barley have anything", "@_leah2 it was closed for mad long before the target opened", "Target sucks go to kohls", "Shut up", "Wow…. What a cool capitalist hellscape we live in", "vault tech logo from fallout", "I watched on of your stores get robbed in San Francisco"]}, "https://www.instagram.com/p/CyjjbBVO1r3/": {"timestamp": "2023-10-18T21:40:19.000Z", "comments": ["Yes to every single look 👌👌👌", "😍", "Love to see it!!! 😍", "I would def wear these looks!!! 😍", "I NEED ALL OF THESE IMMEDIATELY!!!!", "Love these looks 👏👏👏👏👏😍", "You better!!", "@ebony_sunset each perf in their own way 🫶", "@sxbaaaby  they would look slay on u bestie 🍂", "Love love LOVE", "👏", "Umm so cute!!!! 🫶🏼", "you turn these target looks into perfectionnnn🔥😍", "😍😍🔥", "😍😍😍😍😍 yes", "Yaaaaaaaaaassssssss🔥🔥🔥🔥🔥", "we love to seee it!!!!!!!!!!!!!", "Come through sis 🥳💅🏾", "Running to target!!", "This campaign is so cute! 🔥❤️", "😍😍😍😍", "Love all these looks!! fall is a vibe 💛😍", "This chocolate skirt got me in a chokehold 😂", "This is so cute !!!", "😍😍😍😍😍", "👏👏", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "🔥🔥🔥", "Very mettle white people in your ads.", "@queendann  falling in love with every look 💛", "@_kristapia  yes we do!!!!", "😍😍😍 love these looooooks DEFINITELY ATE let me run to target", "these looks are everything!!", "idk which one to buy first omg", "@hellokelechi  you 🤝 amazing taste", "@cartchronicles101  cute vibes only 🍂", "Cute ❤️", "@target I have to agree. Thanks Targé 🥰", "@mariahmalintzin  major ditto ^^", "@abrieel.jpg  clean plate 🍽️", "Just here rethinking my whole closet.", "Love, love, love all the looks!", "@daffodil421 ❤️❤️❤️❤️", "Work it!🔥", "Fall fits perfect for everything from study sessions to study dates. 😏", "@onedaytaymar no notes👌", "Being dominated with all @target things."]}, "https://www.instagram.com/p/CyeRL7kuBLM/": {"timestamp": "2023-10-16T20:25:57.000Z", "comments": ["Love this 🫶🏽", "Thank you for this opportunity ❤️", "@hbcyoudolls  not over it 🥹", "@target 🤗🤗🤗", "@ashtheprincess_ is amazing!! 😍😍", "Go ash 🥳yeaaaa state 🤍", "@ashtheprincess_  it's truly a W for us", "@ashtheprincess_ okkkkkk maaa! 🩷🩷🩷", "Yesss 😍", "@lexaaayyy_ nothing better than gameday 👏", "@hbcubaddies gameday best day ❤️", "@chiffonblair the truth and nothing but the truth 👏", "Yeah Ashhh🔥🔥❤️", "@amourrr.j_ 👏👏👏", "@_zaliaaaa love to see that hbcu spirit ❤️", "period cousin!! @ashtheprincess_ 😍🥳🥳", "😍😍", "iktr !! @ashtheprincess_", "Lemme run to Target right now", "🔥🔥🔥", "that’s my mama !!!", "So Dope Lil Sis @ashtheprincess_ 🔥🐝", "🔥", "Yesssssss", "Wooo 👏", "@mariinicolee._ talk to me mari 😂👏🏽", "lets goo mama🌟🌟", "@foodoverwifi  we love to see it 🤌", "@cashinwithkels  the best time of the year 👏", "@iamjoseyj 👏👏👏", "@overawls_  see you soon 🫶", "Ayeeeee", "Okay Targét🥰🥰", "Cute ❤️", "we LOVE this!!! 🥰🥰🥰", "@dreamboxbeauty  we truly do 😍", "😍😍😍😍😍Go twinnn i love this", "okay motherrrr❤️", "🔥🔥🔥", "🔥"]}, "https://www.instagram.com/p/CytZO99O7_W/": {"timestamp": "2023-10-22T17:21:57.000Z", "comments": ["Fall town definitely set me up for fall and cozy date nights! ❤️🍁 🎯", "My biggest happiness was when my result came out Negative, I can't thank @osetale_healer enough.", "Okay wait what? Send me a case of Target everything 😍😍😍", "@ali_mrtinezz  i keep saying the same thing 😭", "That trunk would make such a beautiful piece for home decor @target", "@leahsventures  you think so? 🥰", "Drinks, then « Sighs in fall » 😂", "@target 😍😍😍", "Loving it @k_wossie 🙌🙌", "Love my target & my fall collection Love  you Bestie 🎯😜😎🎃🍁🍂", "My guy you made it!!! @k_wossie  I’d LOVE a target case!! 👀", "Woah that trunk is magical, straight into fall town?! I need me one of those! 🤣", "Omg 😍😍😍😍😍😍 need that case 😂", "LOVE THIS🔥🔥🔥", "Handmade, custom Chef knives on sale now, order from link in bio 🔪🔪", "How’d the date go though? 🎃", "On my way to Fall Town😍", "@folkwilde « ily 🍂 »", "@littleruss2 the love goes both ways ❤️🎃🍂☕️", "@loveaplantchic  time to make a visit to fall town 😌", "😍😍😍😍", "Oooh I wanna go to Fall Town!! 😍🎯😍", "@themeilinglist  i'll drive, don't forget your fall sweater 🚗", "@lunamagicbeauty i'll see you there 🎃", "@target Let’s roll! 🎯🚗", "👋🏼👋🏼👋🏼👋🏼👋🏼👋🏼", "@lil_raspberrry  i need like 12 🤭", "This is cute! Cheers to the producer on this one 🫶🏾💅🏾🍂🍁 #FallTown trunks 💫", "Love this ❤️", "@tinafears  the cutest town is fall town 😌"]}, "https://www.instagram.com/p/CylpvyhuMF-/": {"timestamp": "2023-10-19T17:13:30.000Z", "comments": ["Oh wow this is amazing", "Okay now give me 30 seconds 🤣🔥", "I want my 30 seconds too ❤️", "😍😍😍😍", "@shopntarget  so much can be accomplished in 30 seconds ⏰", "cutie girls! 🍂🤎", "Is her plaid crop top she’s wearing sold at target?", "You have employees taking down missing Jewish kids flyers outside your stores in Florida. Do better!!", "i love target 🎯 🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰🥰☘️🎍🍀☘️🎍🍀☘️🎍🍀☘️🎍🍀☘️🎍🍀", "Aw so much fun 😍😍😍", "Please stop using Lone Star Overnight for shipping! I just want to get my package delivered and Lone Star is a TERRIBLE company. My order has been lost and I NEED to to have the product by Thursday of next week! I can’t request another shipping service when placing a new order. 😭😡", "🇮🇱🇮🇱🇮🇱", "I want the plaid shirt! Where is that from?", "I applied to TWO different stores, I have a good resume, I interviewed well and I was turned down by both. Do you need to graduate from Yale to work at Target? I don’t understand.", "Target would you hire me I need a job my cousins boyfriend works at Target so you should totally consider hiring me", "Cuuuuute", "I’m having an inferior customer service experience. I’ve been waiting over 24 hours for a drive-up order. My call was escalated to a supervisor, who argued with me. I asked to speak to a different supervisor. He said, “They will just tell you the same thing.” His solution was to cancel my order. I repeated my request for the second time, and he proceeded to transfer back to the phone tree. This is super frustrating.", "So cute 😍"]}, "https://www.instagram.com/p/Cyg2kIOOTib/": {"timestamp": "2023-10-17T20:29:19.000Z", "comments": ["Oh wow this is fun", "@imfermoraless", "Dang where is this?!", "@simplypetiteray  spooky season is in full swing 👻", "@trendyfavefinds I am wondering the same thing 😂", "I love Target and I want free Halloween  stuff", "Can all Targets do this in Drive Up?! I want to see Bullseye come to my car with prizes! 🙌🏻😍🎃👻", "👏👏👏😍😍😍", "@target now that’s nice to see you finally giving back!", "Halloween decor >>", "Unexpected Halloween FUN 🎯🎃🍬🍫", "Wish I was there ❤️", "Wow so cool!!! 😍", "👏", "Omg this is so cool 😍😍", "target lied to their employees! They will not be getting paid more :) still being paid a non livable wage", "Omggg when is this happening???", "@trendefit  we couldn't agree more 👻", "I HEARD EVERYTHING IN THE TARGET ON 117th IS 50% OFF due to shoplifting ?? Store is closing ?? True or no??", "@ladytatyanax @target", "@chrissiesaysso  Bullseye's dream gig tbh 🎯", "@lynettebarbie  spooky day made 👻", "@ravenzds wow", "Should have gave out Lewis 😂", "Can we do this for Christmas… in New Jersey. Asking for a friend 👀😂", "I wanna be this rich", "@mstruehappiness  i like where ur friend's head is at 👀", "I need that in AZ please. 😂", "😮😮", "I went to the target near me to look for decorations and they didn’t have any 😢", "😍", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "@s.t_powderson  looks like the target that we used to go to in Long Beach by the hospital", "cool...😍", "give me 20 bucks", "@shopntarget  samesies tbh 🥹", "Can we get all in motion and goodfellow and co brand shoes in extended Men’s sizes? 15?", "14 and 15", "Are they doing this in WI? So fun!", "Target- PLEASE stop emptying the Halloween costume and decor aisles more than a week before. Some of us are procrastinators and this last week before the holiday is a critical time for us 😅😅😅", "IS IT AT EVERY TARGET"]}, "https://www.instagram.com/p/CxvH_x8rl-V/": {"timestamp": "2023-09-28T13:00:31.000Z", "comments": ["@target donated 10 Million to #BLM", "DO NOT USE @target SHIPT!!! AWFUL EXPERIENCE MY COURIER TOOK A PHOTO OF THE ITEM AND WALKED BACK OUT WITH IT. @target  Has taken funds from my account and no update on resolution!!!! Absolute disbelief", "The target in concord ca always has expired yogurt but I still buy it", "👏🏾", "Beautiful", "More fear mongering from Target you're not closing down your stores because of crime that's a lie there are stores that are open that have way more burglaries than the stores are closing", "I was charged incorrectly for an item and I dm'd you no one helped", "@blazesmodel<D'M_WITH", "❤️Beautiful", "The situation in Palestine has become catastrophic. Where is the international community in the face of the ongoing bombardment of homes and the genocide inflicted upon children, women, and civilians in every corner of Gaza? The scenes we witness are devoid of any humanity. No water, no electricity, no food, no aids, no medicine. The international silence towards this disaster is an unforgivable crime. May Allah safeguard our people in Palestine, and restore their peace and security.", "That’s wild", "How about you actually have cashiers in stores?", "@miriamvillaloboso", "Target created two gift cards on my account and refuses to refund me for the second gift card. I spent 40 minutes on the phone with customer service to be told it's Target policy, that they can't refund me for the gift card that was NEVER supposed to be created, and then got hung up on by the representative for asking for the issue be escalated.", "@laura_escutiav keeeh? Estoy corriendo al Target", "We Want DESMOND BENJAMIN", "I bought a gift card and it was already redeemed and I could not return it so now I lost 25 dollars", "@target  apparently optical centers in Taget can ban you.  I had a prejudice employee not wanting to help a customer.  Now that person still remains at the Target Centerville Utah location,  how us that ok Target? But to ban a customer...hmmm maybe I should  press record and post. @target", "We should be over racism @target if you guys are posting this,  why have employees that don't understand we are over these times.", "I heard y’all want feedback on your test stores with 10 items or less self checkout. He hate it. It doesn’t work when you have no human employees working the checkouts! We had one cashier 15 people deep and empty self check outs. Y’all are crazy!", "🌟 Welcome to healthmattersmart! 🌟\n\nHey there, lovely friends and followers! We're thrilled to have you join our Instagram community. Whether you're a long-time supporter or just discovering us, we're so grateful for your presence.\n\n📷 What to Expect:\n🌈 Vibrant content that brightens your day\n🤩 Behind-the-scenes peeks at our world\n📚 Informative posts that inspire and educate\n🤗 A space for positivity and connection\n\n👉 Here's how you can engage with us:\n\nDouble-tap ❤️ if you love our posts.\nComment 💬 and share your thoughts.\nSave 📁 posts you want to revisit.\nTag a friend 👫 who'd enjoy our content.\nTurn on post notifications 🔔 so you never miss an update.\n💬 We'd love to get to know you better, so drop a comment below and tell us something about yourself or your favorite emoji! 😊\n\n🌐 Stay connected:\n📩 DM us for any inquiries or collaborations.\n📣 Spread the love by sharing our posts.\n📸 Share your adventures with our products using #YourHashtag.\n\n✨ Let's make Instagram a positive and inspiring place together. Thank you for being a part of our journey!\n\n🙏 Your support means the world to us. Cheers to new beginnings and endless possibilities! 🥂\n\nWith love and gratitude,\nhealthmattersmart", "Patiently waiting🤗🤗🤗🙏🏾", "@TargetNews Buyer beware of Target gift card purchases. I was sold a used gift card and their customer relations refuses to resolve or refund. This is reminiscent of targets  debit/ credit breach in 2013. Imagine receiving a gift card that cannot be redeemed!", "Yea 🙌", "@target & @shipt TOOK MY MONEY AND THE COURIER IS ON CAMERA WALKING BACK OUT THE BUILDING WITH MY PARCEL. Shocking @fentybeauty", "funny 😂😂", "@badgalriri Congratulations 🎉", "Why do you have anti-semetic employees working at your Aventura store??? Does this company agree with terrorism and taking down posters of hostages?", "You are employing terrorism supporters at your Aventura location. They need to be fired immediately!!!!", "😂", "Shame on target!!! Your employees removing photos of hostages of Hamas and giving middle finger!! shame!!", "I want to look this good in a Target just once in my life.", "@target fire your employees in Aventura that tore down posters of Isreali and American hostages!🤮🤮🤮", "Can you come open the case so I can get toothpaste? I’m at the city ave location in philly. Been standing here for 10 min.", "Heyyy fam ❤️😘 Servin snackz", "An Open Letter to Alikay Naturals and CEO Rochelle Graham of Black Onyx World \n\nIn this era of digital connectivity, the values of transparency and accountability stand tall. As a dedicated service provider, we pride ourselves on fostering professional relationships with our esteemed clients and anticipate a similar ethos from them.\n\nIt is with a heavy heart that we bring this concern to the public domain after our consistent efforts to address it privately were met with silence. Our collaboration with Alikay Naturals involved the provision of two committed Virtual Assistants from our end. Despite their unwavering commitment and diligence, we find ourselves awaiting remuneration for the services delivered. The pending amount has now escalated to several thousands of dollars.\n\nOur team has reached out to Alikay Naturals and @therochellegraham multiple times through diverse communication channels, including emails and direct messages. Regrettably, our endeavors have been overlooked. It's disconcerting to witness businesses, particularly those with a substantial digital footprint, sidestepping their commitments.\n\nBeyond the immediate concern of unpaid dues, there lies a more profound issue. This isn't merely about unsettled invoices but the inherent value and regard for industrious individuals, particularly those hailing from developing nations. Exploiting service providers from these regions isn't only morally questionable but also contradicts the tenets of fair trade and reciprocal respect. Every individual, irrespective of their geographic origin, is entitled to dignified treatment and just compensation for their contributions.\n\nWe earnestly appeal to Alikay Naturals and CEO Rochelle Graham to address this pressing concern. We remain optimistic about the potential of constructive dialogue and are keen on amicable resolution. However, our commitment to justice and the rightful treatment of all service providers remains unwavering.\n\n#StandForJustice #FairTrade #ValueEveryService #AlikayNaturals", "hey @fentybeauty i'm casting LGBT modeling shoots, can you hook me up with someone to talk about recs? product or models", "What time do Stanley cups release online tomorrow?", "@el.aviv AGREED….never again Target", "Chef knives set on sale 🔪 buy now for the holiday gifts. Link in bio", "So frustrating that @target keep reporting my posts as spam!!!! LACK OF BUSINESS ETHICS SIMPLY BECAUSE YOU DONT LIKE THE NEGATIVE SENTIMENT IF MY EXEPERIENCE", "Designers marketing is hard;look.", "oh my!", "😍😍😍", "Berleezy got it 😂", "Ghetto brand? I don’t think so", "🙌❤️"]}, "https://www.instagram.com/p/Cyqx6RQOc3Z/": {"timestamp": "2023-10-21T17:03:58.000Z", "comments": ["How y’all not include @aaliyahjay ? 😩😩 she’s thee baddie !", "❤️😘", "The app didn’t let me order beauty steals twice this week and another large haul when the diamond gift was available. What is going on with the app?!?", "@thatgirl_kim__  we know exactly what you mean 🥰", "@target @frilancy did you see?", "Woooooooowwwww!!! So here for this 🙌🏾🙌🏾🙌🏾🙌🏾👏🏾👏🏾👏🏾👏🏾", "The Target I go to, the cosmetics and bath & body Care section is always a complete mess😢 I doubt they will be carrying Fenty at that one", "I'm seeing Fenty ❤️", "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "🔥🔥🔥", "😍💙❤️", "👁👁", "@kkmdbeauty same for me. Im tired for this", "Kindly contact the manager on WhatsApp for clearification +1516-642-4113 @dbswaistbeads", "@mikeyspade contact manager on WhatsApp for more information +1516-642-4113", "@target @shipt PLEASE FIND A RESOLUTION TO MY CASE. YOU HAVE FAILED TO FULFIL MY ORDER BUT HAVE TAKEN FUNDS", "❤️", "Target focuses on advertising campaigns primarily on individuals from Black and Hispanic backgrounds. While diversity is important, it is crucial to ensure fair representation of all nationalities. By exclusively highlighting specific ethnic groups, you may inadvertently alienate customers from other backgrounds. I kindly request that you consider adopting a more balanced and inclusive approach in your advertising strategies to better reflect and serve your diverse customer base. @target", "👍", "I spied my favorite @aishabeau 😍", "@deidreforever 🥰🥰", "the app and website is not working. I cant shop the sale.", "IAMPERFECTT.COM", "❤️💙❤️", "This is an event that took place at an historically BLACK university. For a brand that was a trailblazer in the beauty industry, forcing competition to expand shade ranges and even consider poc as customers", "@kingxkhi and giving that target just began selling fenty beauty it would make sense to highlight this event", "❤️", "🔥🔥🔥", "Riri the best ❤️❤️", "😍😍😍😍😍", "You don't have to be a Muslim to support Palestine, you just have to be a human 🇵🇸 🇵🇸", "😍🔥😍", "Hi! You added some of the items from the Elf and Grinch collection but they were already sold out when they appeared online. Will you be restocking them???", "TARGET SUCKS", "#boycottopalhouse", "😍😍😍"]}, "https://www.instagram.com/p/CyljLPeOWpk/": {"timestamp": "2023-10-19T16:17:57.000Z", "comments": ["I wish our target had a Starbucks! 😢", "Wait… what!?!? ☕️💙", "@lulubelle1115  so excited for this tbh 👏", "@nicoleloveless  let's ask the question but we know the answer 😏", "Obsessed with @hanndango 🙌", "@jessikalynorozco  it's sooooo contagious 😂", "@emilyowensley girly staaaahp 😍", "Target employees are up there with CFA employees. The. 👏Level. 👏Of. 👏Commitment. 👏", "@lolly_jozefovic I was wondering the same thing @target", "Can you come open the case so I can get toothpaste? I’m at the city ave location in philly. Been standing here for 10 min.", "@bethany_rilea probably depends on the state. In California the minimum wage is $15.50 so they aren’t paying minimum wage in places like that. That’s why there’s a pay window and $24 was the highest of that window.", "Omg mine just started this too!!!", "@target you are the absolute best and I love that when I think convenience my brain always goes to you first. Now… you just need to do a wine happy hour in store and sales would increase exponentially.", "@brookg83 next time I have a pickup order", "😂😂😂", "@simplypetiteray  new level of ✨joy✨ unlocked", "our store hasn’t had drive up for almost a month now", "@the_avocado_mama", "@santiii_m1_ the Starbucks by me is easily a 20 min wait in drive thru. Target Starbucks, ready in like 4-5 mins! Best thing ever!", "@deliadollface it’s basically the best thing EVER!", "Yes! I used it earlier today for the experience!!!", "Target KNOWS what’s up & I’m here for it 😍🎯❤️❤️❤️", "@noblefriendsshop", "@miselaineous86 😂", "Target 🙌❤️", "@bitsofmagic_ this", "It already takes them forever to bring out the orders, that would make it longer", "@sarah.wiseman__ @kt_wisewoman  @ksully60 @therealwiseman", "Ridiculous.", "Game CHANGER!!!", "@maryamgsm this was me when I found out 😂", "@vandenvogue as a target drive up employee, at least at my store- starbucks is on the way out so it’s super easy to grab because they usually prioritize our orders. I am allowed to take tips for bringing bags out and usually share with starbucks if there is a drink in the order too!", "Right?! Like Christmas and your birthday all at once.", "@jdannelley  wow we might need to start using that one 📝", "@vandenvogue lol", "@keniaflores I forgot I changed the world. I need to go back to bothering @target for paying me my dues!", "Loving this ❤️", "@bitsofmagic_ honestly target Starbucks employees have it easy. Starbucks store employees deal with the huge lines. In store. Drive thru. Pick up. Mobile ordering. They’re the MVPs. Target ones usually do little.", "The real question is why do you always charge a dollar for bags and when I take 0 only ever refund 10 cents. Charging me 90 cents Everytime for no reason", "@jerseygirl_0223 far from true. at my store starbucks tms are worked to the bone, constantly short staffed, and have extremely long lines on top of multiple drive up orders… just as hard as an actual starbucks", "@jerseygirl_0223 as a Starbucks target team member who has worked at both Starbucks and target Starbucks I have to disagree.  The location that I'm at now is much harder to work at because were understaffed and it's a very busy location.  Some target Starbucks are probably slow but not the one I'm at.", "@jerseygirl_0223 not really because it’s often heavily understaffed, like 1 to 2 employees at once max and target gets very busy and everybody wants a drink", "@stephanie__dunne I just saw this yesterday!!!! This is dangerous 😰"]}, "https://www.instagram.com/p/CyT9z3oucB2/": {"timestamp": "2023-10-12T20:21:45.000Z", "comments": ["@maurap12  so happy to hear bestie 🥰", "@christina_ski23  he's too cute!!!!", "@________steph  cover your ears Bullseye 🙉", "Whaaaat 🥺🥺🥺🥺 WANT ❤️😍", "@gee.ilan  you know the drill... run, don't walk!", "😍", "@target 😂😂😂", "dejen de vender plumón", "@cecycarreon that's our pup ❤️", "@_agentdanny  sounds like it's meant to be ❤️", "@_ava_squared  same 💖", "@shabbychic_targetfreak we had the same reaction 🥹", "Even when I'm not actually in target, target still finds a way to tell me what I need to buy 😂😩", "Bought him yesterday!", "Ohhhh soooo adorable 😍", "@target I just want to let you know that I just visited the Charlotte West Location. There is 1 teenager working at the Customer Service Desk and he is also taking care of drive ups and 1 teenager working at the Starbucks. @target does that make any sense to you! And when I asked the teens where the managers were, they didn’t know if anyone was there. So I’m not sure if they are having a meeting but meetings can wait when you have 16 & 18 years old working in two do the busiest areas of the store!", "Your recent updates to the app suck! So now instead of seeing ALL the Circle offers we only see ones for things YOU THINK we might buy. @target", "@chamberlanelv  the cutest little guy ❤️", "@vopdycke  W", "we need target in spain ASAP", "I want one!! 😭💚", "I called all 8 departments of your Woodinville store and none answered i thought customer service is import?", "I love him he’s my cuddle bug & yes I’m an adult 🙄❣️ tooo cute to not get", "please employ me, i need this job @target", "@irohhaven  maybe three even", "@dr.truuth  it happens to us too 😂", "@mrs.gregory_xo", "I love this version of Bullseye😍", "@cutechichai the cuddliest version by far 😍", "@clairemonty76 show Cassie this wee guy 😍", "@vanillxss he IS your cuddle bug ‼️", "Need this ❤️", "see you soon? 😉", "@target So true", "Why are you wholesome?", "@kaz_mafia_mystery  why are you cute?", "@target OH MY GOD YOU'RE THE CUTE ONE! I get it from you...and my mama! 😉", "@target mother", "I want one 🥺", "Wow, beautiful!!!!!", "the team leads at my target may or may not have had relations with the high school students"]}, "https://www.instagram.com/p/Cyy1kKquvhS/": {"timestamp": "2023-10-24T20:07:56.000Z", "comments": ["Creative and loving it 🕷️", "Wowww!!! 😍😍", "@v.webb84 this has you all over it", "Target this is more Walmarts speed…", "@shopntarget  scary good 🕸️", "That looks fun and delicious!", "@davidwma  feels like you a bit!", "I love him!!!", "@targetpops  honestly i got spooked at how tasty this was", "@steelenutrition_dietitian  no tricks just a v delicious treat 🕷️", "@lesliesnotinteresting  Nikk is a vibe fr ✨", "dejen de vender plumón", "now I want pizza 🍕", "Yummy 🤤", "@rvxmendoza  splitzies??", "@target SPLITZIES!?! 🫨 IF U WANT ME JUST SAY THATTTT 😭", "But where are the noodles?", "Im not as excited for Halloween and I am for M&S coming again this year. It makes my heart warm and I can’t stop thinking about it 🥹 thank u for partnering with them. Hoping many love them as much as we do so it’s here every year", "@irinagbrown add 4 baby spinach leaves and you'll be ok"]}, "https://www.instagram.com/p/CybXBlZOEEg/": {"timestamp": "2023-10-15T17:18:05.000Z", "comments": ["@osetale_healer", "Just picked up my collection at my local target! Easy Peezy ordering online last night. Love, my turkey, mushroom, and all the other accoutrements! Thank you, Mr. Derian. The only thing that could be better is visiting your store again in New York City. ❤️", "Y’all website is glitching. Please fix it thx -Management", "Loved his collection a few years ago for Halloween! Please collab again for Halloween next year 😍", "😍👏", "Ordered the Turkey 🦃 pillow! ❤️", "Amazing collaboration!! My wallet is crying rn lol. Hope we get another Halloween line next year 🦃🎃", "I bought everything! Gonna shut down my target card now the turkey 🦃 is the best", "So festive! 🦃", "Love the turkey pillow and pie transporter!!🤎🥧🦃", "Yesssss 🦃", "@cashinwithkels  it's 🦃 time", "@finds.food.fun you have an eye for the finer things in life 🤌", "Incredible line with great prices.\nJust picked up the beaded Turkey pillow as well as the beautiful cloth napkins😍", "Oooo...nice!", "@allthemerry going all out for turkey season 🦃", "@rob_to06 do you have a fave in this collection? 🦃", "Love!", "Hello! Really love your store! I just called in an order that was a pick up in store order at my local store. I wanted to put a note on the order that I do not want a plastic bag with my order. There was only a couple of things in the order, but there was nowhere to write a note. I called  to speak to someone with my order number & let them know but they told me that was not possible 😢Sooo I wanted to put in a good word in here to see if there was a way to make it easier for  customers  avoiding single use plastic to be able to do this easily! Thank you so much ❤️🙏🏼", "@maiwayalways1 great picks bestie ❤️", "@littlebrownboy38 😂😂😂", "@triciadesertqueenyv  it's a must have honestly", "@sish.life this collection is my love language ❤️", "@jaque_coellho can we hear a little commotion for the turkey? 👏", "@target I ordered so much but y’all need to really train your packing department. So much fragile stuff (hello…huge tureen) was just put in a box. No packing , no bubble wrap, nothing. It arrived in a zillion pieces. Item is sold out so I’m just out of luck.", "@target my favorite piece is the Turkey Shaped Pillow, but all the pieces are amazing!! Hope to see more collaborations 🙏🦃", "Already picked up a few pieces, this collection is so good! 😍", "Hey @target This is an awesome collection and I bought nearly everything. It got delivered today and 4 items broken. No replacements since it’s sold out. 👍", "Already sold out on the turkey and mushroom pillows.  Will they be restocked?", "@target are there going to be any more? 😭", "Hope to find it soon 🦃 🍁", "I just went around to 4 local Target stores and scored on some of this beautiful decor!  I LOVED this collection!", "Any restocks planned for the bigger turkey?", "@jailbirdjubie can't wait to see the haul 😌", "So bummed I missed out on the turkey!"]}, "https://www.instagram.com/p/CyMPsLkuD3-/": {"timestamp": "2023-10-09T20:26:48.000Z", "comments": ["Beautiful 🤩", "Loving this line 🙌", "I just snagged some items from this line, it’s beautiful!", "😍😍", "I was so impressed by everything but those cutting boards are a game changer 😍😍😍", "I saw this in target the other day and I was tempted but I need it in black or grey", "I bought 2 of  the spatulas. Small but so cute.", "Neeeeed!", "It’s perfect ❤️🙌", "Now this i lovee", "The best kitchen finds😍", "I love my new frying pans!!", "thats so cute i want it🤩", "Love ❤️ these!  The cutting board is a must have!", "🙌", "@craftingwithcrazy  the way everything fits together is just 🥹", "@homeonharbor  dinner will be picture perfect 📸", "@nathysandoval  it's true ^", "@thisisdru  just like ur taste for design 🫶", "@robynb66me  a good cutting board is a key ingredient for a good kitchen 🤌", "@liz_and_tiki  cooking will be hitting this fall 👩‍🍳", "dejen de vender plumón", "Show me more 💚🤍💚", "@maryaniontiveros  time for a kitchenware refresh? 👀", "@target ❤️❤️❤️", "Do you have shipping to Mexico?", "Love ❤️", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "Hello good afternoon, my friend mail e-card to me from target since yesterday I can’t access the into the card so that I can see the code. \nPlease help me out @target", "@stylesonsty these sets 😍 >>>", "😍", "Everything is totally needed rn", "It is beautiful", "Love it! ❤️", "I bought the whisk and love it. Next time I will try the bowl mix set. I love the colors. But first I have to find a place for it, my husband could get crazy if he find out I bought another one 😂.", "Loving this new line! ❤️", "@sarah.patteson913  join the club 🍳", "@furnishflex the aesthetic 🤌", "Love🙌🙌🙌", "❤️", "As a foreigner…sometimes I just think about target."]}, "https://www.instagram.com/p/CyOsfyouuDE/": {"timestamp": "2023-10-10T19:17:09.000Z", "comments": ["🙌🙌🙌", "😍😍", "Target girlies unite 🙌", "The bright neon outfit on the mannequin got my attention! I tried looking for it on the app, but I couldn't find it 🥲", "@leilaniamara_  u have my whole heart girlie 🫶", "@morphebrushes  may i just say ✨finally✨", "@jaque_coellho  when you're a fall girlie AND a target girlie 🤌", "@glassyskinofficial  it's fall capsule szn 👏", "Hello @target ,\non the 20th of September of 2023, I wrote to you a message in Instagram chat and then you sent me an automated message that you will get back to me soon and you have not contacted me until today..🤷🏻‍♀️🤷🏻‍♀️", "Ugh I love it! @ggaudyo", "Me encanta Target", "@char_m_c such great Fall looks", "Target girlies are the best type of girlies!! 😍", "Love them all!! Have to find that plaid set 😍❤️", "Target girly forever!!", "shrek", "I come all the way from England 🇬🇧 to visit Target me and my family love it. I've just been to a few in Orlando spent a fortune had to buy a extra case Halloween stuff was fantastic, and it was better than England ❤️❤️", "Love it", "@labelswithlattes le più zoccole direi", "@target na zoccola vuoi dire.", "@hello_home_girl it’s their satin slip dress, layered with their satin button down (I know because I fell in love with it too lol)", "@__frogprincess__ thank you!", "@labelswithlattes  it's the truth 💅", "@narlsss  it's a must ❤️", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "Hello good afternoon, my friend mail e-card to me from target since yesterday I can’t access the into the card so that I can see the code. \nPlease help me out", "@alisonswash1972  you came all the way across the pond for us? 🥹🫶", "@melissamatal  TGF ❤️❤️❤️", "Can you remodel my target in the forum fort myers pls", "These finds are soo good", "😍😍😍😍", "😍😍", "I love the skirts but they don’t fit 😢  and the  stores  hardly carry xs", "Jeans are amazıng", "@anna.litepink yes, Walmart must have changed buyers!", "@okandanoksan we have a pair waiting for you 👖", "Impossible not to 'fall' head over heels for this collection! 🍂👢", "@adroll  indeed impossible 🍂"]}, "https://www.instagram.com/p/Cx6EmuDuev4/": {"timestamp": "2023-10-02T19:00:46.000Z", "comments": ["@pipisaitta", "Por qué no abren una tienda en Chile 🇨🇱 por favor", "Target is my happy place, even just browsing is fun❤️😊👍🏿", "@cassie_jane_jordan omg!!! ❤️", "I wanna ride the Target Circle party cart 🛒", "How come you all don’t sell yarn in store?", "🔥🔥🔥🔥🔥🔥🔥🔥", "@newyorkrudd94  you and me both 🤝", "@jaylatanyia  brb showing this to my boss 🏃‍♀️", "@colormehappyxox  made it just for you 🫶", "@targetpops  this is our mona lisa", "@targetqueenri  buckle up 🫡", "@emma_and_olivia_play  THAT'S OUR FRIEND", "@evelynbarreto324  love u too 🫶", "@snickerdoodles76  there's room for everyone 🛒", "@_a.lee.na_  hold the limo, we need a target cart", "@aliprad12  get in 🫶", "@target yasssssss!!!! I’ll take a @target cart any day over a limo 🙌❤️😍", "@ajpam2829  thank u 🥹🫶", "@ultabeauty  we'll always save a seat for you 🩷", "@squishmallows 😍😍😍", "@target 😂", "@target 🥰🥰🫶🏾🫶🏾🫶🏾", "@pauisoto jajajaj tu q eres fan", "@danielarpv siempre Jajaja", "❤️", "10 items or less at self checkout? Really????\n Open up some lanes then @target . What a joke- job security?", "That is awesome😂😍", "Target is the place where you come in and get 1 item and the leave with the whole store 😭", "I needed that cart on Monday lol and I'll be back sat catch the last of circle week 🎯❤️❤️", "Hi @target , I sent you a direct😍", "Dejen de vender productos con plumón por favor", "What town is the Target video post in?", "I want to be driven to work in this cart ONLY!😍", "Can someone from corporate come help the Target stores in my city? I love Target 🎯, but lately…? It’s a depressing and annoying shopping experience. 😢", "@target true friend 🫶", "😍😍😍😍😍😍😍😍 omg I love all!!!", "I want to be in that bus NOW 😍😍😍😍", "circle week was it", "@liltunechi @richforever @jayz Blues", "Where is this?", "Wow so cool ❤️"]}, "https://www.instagram.com/p/CyGnwrquo6K/": {"timestamp": "2023-10-07T15:58:03.000Z", "comments": ["I knew this had to make it on to Target. 😍🙌", "@joleen.mitsuko thank you Joleen😍😍😍", "@sandrainthecity hehe thank you Sandra! 🥰🥰🥰", "So cute!!", "Omggg❤️", "@haddadlau 🥰🥰🥰🥰🥰🥰thank you so much Laura! ❤️❤️❤️❤️", "@anniemaithai OMG - she’s the cutest!  totally made my day ❤️❤️", "@itsjackiecarp  literally can't get over it ❤️", "@mariajscla  her resume is incredible 😂", "@stephanieowenskelly  our number 1 fan ❤️", "Wishing you would actually ship items bought during circle week @target", "@lilymojekwu awww thank you so much 😍😍", "@nolanwicker we can wear them. they have to be solid color. and we can wear shorts too. knee length off.", "@nolanwicker ofc*", "Wow, thats awesome! 🤩 Im definitely taking advantage of this deal! Thanks for the heads up! 🙌", "❤️❤️❤️ this is sooo cute!!!! I love it.", "@melisaruda_ Future costume for Vivian?", "@margerystanton OMG yes 😍", "Stop it right now 😂😍❤️", "❤️❤️❤️❤️❤️❤️❤️❤️", "Omg... she is adorable.  What a great way to market those little carts. 🥰", "She’s so adorable!!", "@pepperellbraiding  she understood the assignment 🛒", "@lifeofken258  the cutest shopper 🥰", "@alexislovesme  can't stop won't stop 🎯", "❤️❤️", "Adorable 🥰", "She has a walkie-talkie😍 how cute . She can be our team member", "@meka1175 it’s so cute 😍", "@japarks_27  this should be sissy’s costume", "LOVE THIS! TARGET LOVE YOU SO MUCH", "How about using real items instead of props🤷🏽‍♀️", "Lol love this !", "@sweetsusiemacc  the absolute best team ❤️", "And Employee of the Month goes toooo… 🏆🎯", "@no7usa  no but fr", "@target 😭💞", "@target Bring back @bonamiclean products", "#awesome ❤️⭐⭐⭐⭐⭐", "@sialfarrukh5  circle week may be over but these items are still around! ❤️", "The job market is crazy", "Adorable 🙌🙌🙌"]}, "https://www.instagram.com/p/Cx3SO8iR5kk/": {"timestamp": "2023-10-01T17:04:43.000Z", "comments": ["Brb, I have some errands to run 🤭", "Glad her products are in target", "", "Yessssss😍😍😍", "😍😍😍", "🔥🔥🔥", "@dani_alaniz", "It ain’t safe", "😍😍😍", "Yessssssssssss 🙌", "@chelley0623 girl I love her makeup", "Bring back all the match stix and make em magnetic damn it", "Walmart could nevaaaaa", "OMG", "make some noise yall wtf😫😫😍🤣🤣🤣", "PAY YOUR WORKERS MORE!", "Omg 😱 ❤️❤️❤️", "That team member discount 🥴🥴", "@karla_koolestever 😂😂😂", "I have to give you guys credit on your store because not only is it super organized but it also has other brands and I think that’s incredible", "🔥🔥🔥🔥😍😍", "Oohh-Whee!", "This is absolutely so dangerous and I’m here for it", "YAYYYYYYYYYY", "Wow us in the UK don't even matter", "💯💯💯", "🤩🤩🤩🤩🤩🤩🤩🤩🤩", "i will be stealing it 🫶🏾", "😍😍😍", "Wowwww", "I’m about to max out my target credit card and I don’t even feel guilty about it!!!!!!! @target @fentybeauty", "😍", "They are gonna steal it all ..", "now i’m never leavingggg😭", "CAN WE GET THE FRAGRANCE IN ULTA THOUGH?!", "My target credit card just can’t get a break! 😩🤣😂", "Game changer. Thank you for making all of our dreams come true 👏🤎", "Whew!🙌🏾😮‍💨🔥🔥🔥", "Yayyyyy 🔥", "Omg!", "Chile 😩😩😩😩", "Not sure how I feel about this", "We’re in loveeee we’re obsessed!!! ❤️❤️❤️", "@myak34", "🌼❤️🌈✨🌼❤️🌈✨🌼❤️🌈✨", "@target 🌼😋🌈✨", "🙌🙌🙌🙌🙌🔥❤️", "Yeah don’t trust Target. They took my order for Cowboy Ken then 6 days later they cancelled it. Lying by saying it was my financial institution’s issue which I researched and that was not true. The other excuse was a computer glitch. They oversold and then just canceled with zero help on reordering or another remedy. Horrible company and customer service", "I don’t got this at none of my targets 😢", "😍"]}, "https://www.instagram.com/p/Cx_QirwuxP5/": {"timestamp": "2023-10-04T19:22:39.000Z", "comments": ["Regardless of this pandemic #COACH___ISABELĻA1🤲  has been be a savior to me Im do grateful for all he did you can also give it a try", "The whole world get to know how good and generous she is and i won’t stop saying this cause my life has taken another greatly shape financially #COACH___ISABELĻA1🤲 💯", "So Excited 👍👏", "Success seems to be connected with action successful people keep moving they make mistakes but they dont quit thanks to #COACH___ISABELĻA1🤲  for your help", "@snowbrry girl lemme tell you everyone is applying but they’re so picky rejects most of the application unless you’re available to work every day.", "These are basically samples?", "@sreelakshmiboggavarapu  wishing you many snackz on your next target run", "@trendyfavefinds even-more-fun sized", "@lrochelleb  it's the cutest of all 🥹", "@gina_hernandezzz  Riri can do no wrong ☺️", "@travelwithcheray  it's a precious collection 🫶", "@simplypetiteray  lipstick shopping is a holiday in itself 😍", "@themommathatcould  it's truly sooo good 😍", "@morgan.sinclaire  sounds like a mid-week Target run is in the plan then? 🎯", "Oooooo", "THE CUTEST!", "@ourdreamiest  small size but big personality💄", "@hemiscat3928", "@hauz.and.co and aaaaah 🤩", "@krystal.v.padilla", "@ultabeauty right? the in-person vibe is unmatched", "@maria.040707 oh cmon", "GIIIRRRLLLLLL🔥🔥❤️ @marleencarre0n", "@janeaan_3 girlllll😝", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "I love Fenty lip gloss ❤️. Her nails are 🔥🔥", "@snowbrry this is when it’s worth to have a Costco membership", "I 👏🏾 can’t 👏🏾 wait 👏🏾", "I wont be shopping at target.  It takes 20 minutes to get anything unlocked. There is a fred meyer across the street from mine", "*Goes to Target for the 5th time this week* 😂", "the little target cart 😍😍😍", "@junepapermarket  good thing snackz are served ✨", "@fashionzchick everything is 🤌🤌🤌", "@target Yasss ❤️🔥", "Love this🫶🏻", "That girls nIls@look horrible", "@fentybeauty  dreams do come true 🥹", "@tuxedocatisboss  teeny tiny but mighty 😍", "I don’t use a mini cart.🤭 just a reg shopping basket 🧺 mostly of matte lipstick, a romance novel, a @officialrainbowhigh doll, candy, and soda.:) #shopaholic🛍️", "This is 🔥", "@shopntarget  in our snackz era 🤌", "#Excellent ❤️⭐⭐⭐⭐⭐", "Those nails are creepy.", "Show me more 😍", "I watched the video and looked at my husband, haha!"]}, "https://www.instagram.com/p/Cx0nUU0u2yj/": {"timestamp": "2023-09-30T16:08:46.000Z", "comments": ["I bought the french bulldog bookends. So cute!", "😍😍😍😍😍", "♥️♥️♥️", "You have no sense of style unless you are matching with your pup🐕 #fashion #truth", "So cute🥰✨", "The dog 😍", "This has got to be one of my favorite collars from Target. I want everything ❤️", "🙌🙌🙌", "😍😍😍", "@llynsae  such a classic collar ❤️", "@target collab* 😂", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "Will the adult Kindness short be restocked? Yes or no?", "@flaviajenny2022 this collection is on my mind 24/7 ❤️", "So cute!", "The doggie shirt is so adorbs", "@sleepdoctormer  rowing blazers is pup-coded 🐶", "@target shame on you for putting a 14 day return policy on this collection and not disclosing that clearly. Now I’m stuck with a bunch of awful quality items that don’t fit.", "🤣🤣🤣"]}, "https://www.instagram.com/p/CyECiuoOJzM/": {"timestamp": "2023-10-06T15:55:49.000Z", "comments": ["@targetbabefinds our spookiest fave 🧡", "🙌🙌🙌", "@glassyskinofficial me when i see lewis", "I love Lewis!!!!!!", "@lindsaybolton  you 🤝 loving lewis 🤝 me", "@acosta.831.45 gosh why so mean??", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "Lewis 🙌", "This is so fun🎃", "Please come out with Lewis merch 😢", "Lewis living his best life 🎃🫶🏼", "Target share some Lewis profits with a poor broke moving gal who made Lewis go viral and got him on GMA 😭", "Love it!", "Not even my history is showing up on it from when I added them on my account only one purchase from 2021 shows up this is absolutely inaccurate", "I took a photo last week of Lewis~ he was just chillin and I couldn’t resist his charismatic vibes 🧡", "Team Lewis 🎃💛", "LEWIS", "@target absolutely 🤝🤝🤝🤝🤝🤝🤝🤝", "@targetovereverything TELL ‘EM 🗣️", "@twodayinspo  Lewis 😍😍😍", "Aww Lewis ❤️ Lewis is the heart and soul of the friend group I just know it. Now all we need is a partner for Lewis next year, who slays just as hard!!!", "I LOVE HIMMM 😖😖", "Keep slaying Lewis 🎃😍💅", "@daniellethemermaid12  can't stop slaying 💅", "@luvpoppy.png  he's single", "@target gimme his number 🫡🤲", "RESTOCK LEWIS!!!!! Puhhhlesss. 🎃🧡", "We love you Lewis and ur my bestie 🥹🥹♥️", "My target doesn't have lewis 😢", "@_makixrose._  lewis is in your heart ❤️", "Is that ed?", "... FINALLY HE GETS THE ATTENTION HE DESERVES", "get in loser we're going to target", "Working retail is interesting.  My current job is the first time I’ve worn a walkie talkie… communication and usurpations are kinda interesting.", "Anyone know how to hack Lewis so he speaks Spanish?????", "Humility and confidence.", "Folks who can’t stop trying to “win”… when winning means losing… aren’t leaders.", "Proxy fights in the me too era… it isn’t just this era… it gets more obvious over time.. and does not exist in vacuums", "@thayers  come hang out with lewis and me 🫶", "@target literally omw rn", "Tf are you on about", "You guys should support the military", "You guys should support the military", "You guys should support the military", "BFFs 🔥"]}, "https://www.instagram.com/p/CyB_9nJOuOk/": {"timestamp": "2023-10-05T20:57:20.000Z", "comments": ["Truly loving this! 😍😍😍", "@rizoscurls  it's truly so so special 🥹", "Day 2 of asking target to bring back the ever springs toilet paper", "@target Why do y’all have basic items locked up in glass cases?", "I love this!", "Love this ❤️", "🙌🏽", "@shopntarget  the excitement in their faces 🥹", "So good!", "Absolutely love this!! ⚽️❤️", "👏👏👏👏👏"]}, "https://www.instagram.com/p/CyJUoCrOLE-/": {"timestamp": "2023-10-08T17:13:42.000Z", "comments": ["Clearing the bills of first 6 people to hit me up rn with \"GOD DID\" God bless y'all Amen💰✅", "@marishaleathermansallis", "All the Halloween 😍", "@dt.vision  in use all October 🎃", "Fun party theme!!!! 😍 and the Maple Vanilla frosting is amazing 🤍🤍🤍", "@allyjoneshancock", "@nicolescaltro 😍🍫", "Oh that’s cute!  Looks yummy!", "I have the cauldron mug,\nlove it!", "Love this look! 🔥😍 So fun and spooky! Enjoy your #favoriteday! 🤩", "I must try!!", "@target where are the clear mugs from? Are they sold @target ???", "@the.boozy.ginger so cute!", "@ahespinoza", "Only if Lewis is invited", "Does target sell the clear mugs?", "can yall please bring back the universal thread sherpa color block jackets !!!", "@mrs.rayburn0903 yes theyre by threshold, only $6!", "@chelsea_mullaney lewis is always welcome", "@ml_dunlap  100% as tasty as it looks", "🎃🎃🎃 yesss!!", "Love this idea 😍", "I’d host a pumpkin spice latte party.:) I’m kinda more of a coffee ☕️ gal:) #coffeeaddicted☕️", "@princessrel @bradt888 @jsquared86 next winter activity?!", "@mylittlecozylife everyone loves a party, especially with hot chocolate ☕️", "Looks delicious! 🔥", "@thefirstbbb  can confirm its deliciousness", "💖💕💖💕💖💕💖😍🤩🥰😇", "@madisonwilliams13", "@_kaccee_ I love this", "@amandee92", "Don't mind if we do!", "@jssb_bank  i don't mind either 😌", "These are totally double trouble", "What an amazing idea!😍", "I just want all the mugs especially the clear one 😍", "@makeithappenwithritz  clearly 😉", "@saravanpatten yuuuuuuup!", "@shewhoisreallyreal in euro grazie più spese spedizione?❤️", "Got em’ all 🎃 👻", "I know myself. I'm gonna be thinking about that maple vanilla whip until I get some.", "The cutest, spookiest mugs ☕️👻", "❤️", "Delicious 😋"]}, "https://www.instagram.com/p/CxlK9t-OZwI/": {"timestamp": "2023-09-24T16:13:38.000Z", "comments": ["I’m in love 😍", "😍", "@poorlittleitgirl  a must 👏", "Y’alllllllllllllllllll 🏃🏻‍♀️🏃🏻‍♀️🏃🏻‍♀️", "I moss Target before they sold actual Satanism to children 😢", "@gamer_whit miss* 😢😢", "🔥🔥🔥 this stuff is so adorable", "Obsessed! They’re so aesthetically pleasing 💚", "I need it ❤️", "No Figmint at the Richfield, MN store this evening", "The colors are 😍😍 and affordable as always! Perfection 🔥", "Very pretty", "I think I need it", "@cindydoinstuff  i think you're correct", "@targetpursuit  those colors really do it for me 😍", "@bryanmundjr  time for a kitchen refresh 🍳", "@opalhousetargetmom  a pan for every occasion", "Really loving this quality Figmint line 😍", "Love everything about it!!", "@mindfullymanda815 u and me both ☺️", "👏👏🙌wow", "It’s beautiful!!!!! I’m excited 😍😍😍😍", "@targetpops  get the kitchen you deserve 🔥", "@themealplanningmethod  this is the energy 😂", "@target wow thanks 🥰❤️🫶🏻", "@target 🤭🤭", "How much I need new pots", "Vegas blow it off!!!!! Heads up!!!!!! Lotto!!!$$$$$$$❤️❤️❤️🔥🔥🔥🔥🔥🔥👏👏👏😍😍😍😂😂😂", "Can’t wait for it to arrive at my Target", "I have found so many pieces in this collection that I’m excited about-but every store that I’ve been to looking for it doesn’t have it yet!!", "Loving everything! Bought the salt and pepper grinder set the other day!", "@buschelandpeck  a spicy choice 🧂", "This collection has me in a chokehold. I was ordering items from the collection before I knew what they were. 😩", "@laurafuhratol You should be able to order online if it’s not in-store.", "Of course…I wanted to see it all in person", "@laurafuhratol Gotcha. I just wanted you to get what you wanted. I haven’t seen any of it in person. I just ordered. The quality is really top notch. Hope it all works out.", "Are y’all going to restock the champagne and white utensil set?", "❤️❤️❤️", "The colors are 😍 and affordable as always!Perfection 🔥"]}, "https://www.instagram.com/p/Cx0UTCOO3b7/": {"timestamp": "2023-09-30T13:28:01.000Z", "comments": ["These are really good! Grabbed one randomly a few weeks ago and loved it!", "I just reviewed De La Calle Tepache not to long ago on my page. They are sooo good!!! For a case on Amazon is a bit pricey if I was to actually buy it. But delicious and different. Wish I heard of them before. I would definitely go just grab one or two.", "The citrus one sounds good!!", "Love this so much!❤️", "@vintagewhitefarmhouse  we gotta try that mango chili 😍", "@michellemquinn  love a good random find 🫡", "Ouu we need to try these 😋", "My fave donut girl 😍 @alexandra_lourdes 🍩🍩 Also those drinks look delish. Gotta pick up the prickly pear one 🍐", "They are gross not good at all!", "Good stuff", "Why did you grab a basket for 2 sodas at the front of the store??", "Is is soda?", "Que asteric", "I’ll have to try these 😍", "@charrison615 contains alcohol?", "@target 🤹🏼🐰💕", "@l1v34u  these are really good- tried them a long time ago", "Is alcohol??", "@target WHERE ARE THE EARTH'S BEST MEATBALLS?", "Nothing like reaching over the juices to grab these cans of chemicals.", "@kingz_nate have you ever heard about \"I went for 1 thing and I brought 10\"?😂", "I do not like these, they taste weird. Olipop is better", "The best!!!!", "Hello.  My friend is currently battling breast cancer her ig is elleviews she recently moved into her new place wondering how or if it’s even possible for you guys to gift her with some pieces", "Do they have alcohol in it, just wondering", "I loved these. The mango chili is my fav", "@lizxlazaro", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "Hi @target"]}, "https://www.instagram.com/p/CxtjI2vOttG/": {"timestamp": "2023-09-27T22:29:22.000Z", "comments": ["@patriciasyrene  can never be ready too early!", "@marianny.nx 😍🎯", "@terra_ringo21 This may be dangerous for us 😍", "Please be kind to target employees ❤️", "@target Please bring back @bonamiclean cleansers, I can’t happen to find them anywhere else, seriously!!", "@cdixon618", "Maybe my nespresso machine will be on sale 👀 @crow_caine 🙏🏾", "@vipval2000 pro tip 💯", "Please no not again, I can’t take another beats headphones debacle😭", "I love your top. Is that target?", "Can’t wait!!! 🔥🔥🔥", "@shelby_andres 🙈🙈", "@krazyklearancedealz  another perk of fall! 🍁", "😍", "Let’s go shopping!", "Is it just me or target home decor section is not the same as before 😢", "@target come to Mebane NC!", "Thank you for making the all in motion brand! Lululemon is too expensive and today I was at cycling today thinking the leggings, sports bra, and shirt does the trick!", "Are they different Sales everyday or all the same week?", "CANNOT WAIT", "@5arah target needs to be kind to their employees and cut this nonsense out immediately. I just saw two cashiers get yelled at bc of this. And my poor cashier was one of them. The lady before me. I did my best to cheer her up but you could tell she was frazzled. Not fair to employees and all so they can siphon more data. I see no other reason they force you to use an app.", "@thetargetkart  best week of the year 🙌", "@xomxrie Great question! We have deals through the week and our special Deal of the Day! Today’s 30% off All in Motion and JoyLab activewear! 🙌 #TargetCircleWeek", "@meehshhhelle Did you see today’s Deal of the Day? 30% off All in Motion and JoyLab activewear! Today only! 💝", "@shopntarget I’m already here! 💯", "@luvbuckies Yes! Tap the video to shop", "@earcos_esc Today is the day to get those new boots! #TargetCircleWeek is here! 🙌", "@keturahzapo ☕️ ❤️", "@target just bought 2 pairs 🙌", "I love a sale until my returned items are delivered to the return center with a label I received from you, somehow get lost, and I lose out on my refund 🤷🏼‍♀️", "I use Target circle all the time! Why did everyone else get 15%-20% off on their circle offers but I didn’t get anything?! 🥺 My husband also gets much better bonus offers then I do and I assume it’s because Target already thinks they “got me”…. But I get no love for circle week? 🥺🥺🥺🥺", "common @target w", "@thayers  w like (circle) week 🎯", "@target for the household items if you spend 100 do you get $30 in gift cards back or do you cap at $50?", "Your website isn’t working.", "Why would target circle week be the same week when rent is due? SMH terrible planning", "@anna.litepink lol. Definitely not because they think they “got you”. They individualize offers based on your shopping patterns and the promotions that most apply to you. Circle Week offers are the same for everyone - you just have to go into the app and add them to your Wallet."]}, "https://www.instagram.com/p/CxoNpd4OT95/": {"timestamp": "2023-09-25T20:36:15.000Z", "comments": ["YUM 🤤", "@mdpauliecor25cc", "Omg! All the deliciousness. Can’t wait to dive in.", "The Maple Truffle Cookies are my absolute favorite!!! I found them for the first time last year, and am obsessed!!!!!", "The favorite day brand is trash tbh", "Don’t know who’s idea it was to run the ad with someone wiggling the bags of goods but it’s a dumb move.!!!!!!", "@puzzlingnerd57 they're amazing!", "Scarecrow crunch is my favorite!", "@aurelia2loco", "Ooooo maybe I’ll do a tasting video!!! Those look good!", "@_miami_peach_ get me some 😩", "I'm in trouble when the fall flavors come out! It's almost impossible for me to exercise some constraint!", "Love these😍", "@candicethewhynots  any excuse to throw all this in your cart 🛒", "@mindfullymanda815  which is your fave? 😍", "@els.apage fall is in the air, and the belly too 😋", "@margaretannreed42267  the love is mutual 😍", "@gabby_so_shifty3  best weather, best fashion, best snacks... need i say more?", "@travelwithcheray  so many options too 🍎🎃🥨", "@barbarasnetiker just impossible to resist! ❤️", "@target Ooh, tough choice... but right now it's the pumpkin spice pretzels!!", "Care to explain why you violated title 3 of the Americans with Disabilities Act by asking a man be trespassed because he took to long to pay with cash?", "This time of year with all the candy and pumpkin everything is killing me. I gave up all refined sugar two years ago 😮", "@rinrin729", "i hear these are yum", "The pumpkin shape gummy candy is the best!", "I miss the candy apple pretzels!! Those are my fave and was looking forward to them 😫 I tried the pumpkin spice ones and they do not compare. \nHowever did try the Carmel apple clusters and those were yummy.", "@gabng  creo hay q ir a Target si hay Serca 😊", "Yum 😋", "Target needs to carry our Spicy Pumpkin Samosas next year!!! 🎃", "@sandy.acevedo.52  literally eating that rn", "bring back dried strawberries 🍓", "👏", "@katenorkeliunas 🔥", "Yes please", "Neeed to find them all😁", "yum! 😋❤️", "I know it’s not edible but I hope to find the Native Pumpkin Spice Latte Body wash and deodorant available all the month of October. I was told it was only in Walmart, for October, but they are already sold out of  body wash and it was only the 3rd of October. I am hoping to find it in Target stores! Please! The deodorant I was able to find smells amazing.", "@summerazmat", "@amber__mallick yummmmm!!", "MAKE THE LAVENDER SHORTBREAD COOKIES YEAR ROUND", "@jazgrimes182  please don't yell at me 😂"]}, "https://www.instagram.com/p/CxqvWibO3Se/": {"timestamp": "2023-09-26T20:07:22.000Z", "comments": ["👏👏👏👏👏👏👏", "Currently in my Señora era too so I need all this 😍😍", "Bring on the Señora era!!! ✨✨✨", "Now all I can think about is my morning cafecito ☕️❤️", "@monicamarielo señora era y cafecito queeeeen", "I will take it all ❤️ ☕️", "❤️❤️❤️🙌 Love it Amiga !!!", "I love this so much! ❤️🙌", "@shopntarget  big same 😋", "@target hello ❤️", "😍😍😍", "@lolo.skye fall vibes are unmatched", "@yourbabyelsaa  i'd come to this cafe everyday if i could ☕️", "@brittanyplassman  the world could use more coffee corners 🫶", "@thefighome  a need, not a want ❤️", "@lalauribe_  that's all we think about, every minute of every day ☕️", "@imsandradelgado 🙌🫶", "@mi.ranchito.creaciones coffee corners make everything better ❤️", "😍", "@thegatheringcompany forever and ever 🥰🥰", "best part of the morningis  coffee", "Way to go @monicamarielo 👏🇲🇽🔥", "I love your cafecito aesthetic 😍", "@savvygadgetsboutique nothing gets me outta bed like a fresh cup ☕️", "@la.mera.mera.mom  it's so fun to look at! cozy vibes", "They have theft and crime in 100% of their stores. But why did they only close the stores in the black/latino neighborhoods????????", "@target  STILL looking for info on who to speak to regarding metal in my pretzel container?!!!??!!!!!! This looks like a piece of a machine! Hoping this isn’t in more containers!!!", "this is everything", "@justshootmeraul thank you 🫶🏽", "@imsandradelgado Thanks Sandy!! 🥰", "Target is twisted.", "No lie…I was just looking at that espresso machine and Marielo drink wear collection earlier today when I was in. Y’all really tryna make me go back 😫", "@_shecrazydope  this is the voice in your head saying \"i need it\"", "@target Right!", "@target WHERE ARE THE EARTH'S BEST MEATBALLS?", "latino heritage? mexican should be 🙄", "What is this kind of coffee pot called?"]}, "https://www.instagram.com/p/CxWP5Klu1UG/": {"timestamp": "2023-09-18T21:09:10.000Z", "comments": ["@julianponce quiero todos 😍😍😍😍", "Must have 😍", "“Sorry I can’t work today…need to get Halloween decorations at Target”", "@dante_duke finally!", "Our Target is empty already", "@kingscleaning.co  the whole house must be spooky 🎃", "@target yessssss 👻", "🔥🔥🔥🔥🔥", "@diane_covarrubias_  finally spooky season is HERE", "@831waves  this is so me 😂", "Love this… Hate how they are forcing self checkout and with NO open check lanes! 😭😭😭😭😭😭 Please Target!", "I love those little holiday birds 😍 I just got the spider bird this year 😄", "@eloissetess  necesito que vayas a Target!! 🎯", "I want it all", "@target Finally 🧡🖤🎃", "@target Finally 🧡🖤🎃", "Beauty", "buy 3 things and that's your whole check", "Would love to do a $100 Target Halloween Haul Video for youtube!", "@evie_337 time to fill that cart! 🛒", "@adventure_fox_smile  HUGE fan of the birds ❤️", "I found some clear mini pumpkins is the dollar section the last time I was in the store.", "@nadiatorres33 Hobby Lobby también debe estar de infarto!!", "Yes!! 🙌🏻🙌🏻 finally!", "@eloissetess si quieroooo!", "@eloissetess si quieroooo!", "I need the Ofrenda Dia de Muertos box, please add more so I can buy😢😢😢😢", "@allaboutthataddie it's time to be spooky 👻", "I want this in France 😫😭", "Spooky season ready! 👻👻👻👻", "@target  Come back to Canada. Specifically alberta. Right now.", "@ktlovestoplan  you better believe it 👻", "Love it all 👻", "@shopntarget gotta love spooky szn!!", "The prices are scary too. 🎃💲👀😅", "@betsy__anne__ girrrllll I’ve been multiple times 😍"]}, "https://www.instagram.com/p/CximVXyO6rB/": {"timestamp": "2023-09-23T16:18:04.000Z", "comments": ["@punk_picasso lol! Says the person who’s worried about $$. Just enjoy the options and wtf cares what it costs or it’s value! It’s disposable and a year from now we’ll have moved on to the next trend.", "It’s giving ✨Harry Potter✨ vibes", "Wooow amazing 🙌❤️", "@vinayak_veer going to be perfect for fall ❤️", "@mocha_mi_amor  that blaze is going to look amazing on you ❤️", "Your closing stores do to theft .  Smash and grab African Americans .", "Not cool calling the police on a disabled man. Y’all gotta make this right.", "Notice all the stores target 🎯 is closing are in blue states…. Hmmmm interesting", "Closing stores ? I wonder why 🤔", "So cute!!", "I was hoping to hate something I ordered because I ordered so much of this collab… but nope!  I love everything!!! Best collaboration yet!!!", "Target 🎯", "What happened??? My store always gets the collections. Not this time. Was unable to get anything. 😢", "So Proud of you for shutting down the Store in NYC…  Great Job! Besafe 👍", "Missed out on the navy/green blazer. 😢", "Love it all ❤️", "Funny how your closing 9 stores in the NW but you guys were saying a few months ago the problem was those bigots in the south!  Lol  #stillNotShoppingatTarget", "Y did u guys take the 124 count of size 6 Huggies away wth am I goin to do with 94 😐😐😐😐😐😐😐 @target", "@lalainspiredcrafts  what's not to love 🤩", "❤️", "@target Can you bring back the archer farms mocha almond fudge ice cream 🥲", "Why didn’t the Target in Conyers Georgia get this?  It’s literally the worst store I’ve ever been in!", "😍", "You sent me the wrong package with 2 random sweaters and someone else just got $326 worth of free rowing blazers. Bummed it’s all sold out now.", "😂😍😮😮"]}, "https://www.instagram.com/p/CxbKW7tPqsL/": {"timestamp": "2023-09-20T18:56:45.000Z", "comments": ["On my favorites shelf! 😁🫶✨📚", "On my favorites shelf! 😁🫶✨📚", "Love this!", "Want them all😍😍😍😍😍", "❤️🔥❤️🔥", "@here.everything.you.need  only one target trip away! 🛒", "@chidochicago  book shelf >>> every other shelf", "🔥🔥🔥", "@momsizemeansnosize there can never be too many latino authors 🫶", "@simplypetiteray always a good time for a good book 📚❤️", "@jaime_1st your next read is waiting in the link in bio 🫶", "Ok but which one should I read first ??", "@candle_freak  may or may not be making this my whole personality 👀", "@yusetheboss  genuinely same 😍", "Ok ok @target buena la canción, la cumbia sampuezana 🔥", "@danecisar  choose ur journey wisely ☺️", "@dr.db.okc  SUCH a classic 🥹", "Love this!! 💜 love how you support all", "Mexican Gothic! Sooooo good!👏", "🙌🙌🙌 Great recs @lupita.reads !", "So many good reads!!! 😍", "@stacyish 🥹🥹 thank you so much!!!! ❤️❤️❤️", "What @lupita.reads !! This is amazing.", "❤️❤️❤️❤️", "@stacyish  no misses 🔥", "@jo_jo__x89  yessss one of our favs", "🔥🔥🔥", "@idleutopia_reads !!!!!!!!!!!!! 😱", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "Mexican Gothic sounds interesting!! Thanks for sharing this!", "@lupita.reads  your recommendations are next level ❤️", "good choices target🙌", "So so good!!", "@madysen.luebke  great reads all around 👏", "@lolo.skye ❤️❤️", "❤️👏🏻", "@idleutopia_reads incredible picks 🤌", "@lupita.reads always has the BEST recs!!! Can’t wait to pick up the new Acevedo 😍", "Love to see @lupita.reads killing it as always!", "Y en los idiomas latinos: español, francés o portugués?", "@allison.reads  truly immaculate taste 🤌", "Best recommendations ever!", "@emilyquesadilla", "@genuinelykristen thank you", "🔥🔥🔥🔥🔥🔥🔥", "Silvia Moreno García 🫶🏻❤️", "🔥🔥🔥🔥"]}, "https://www.instagram.com/p/CxQqD0fO4Cz/": {"timestamp": "2023-09-16T17:02:56.000Z", "comments": ["@buildfinancewithjasmine.All my expectations has been granted now, I'm so excited seeing my new house today with the help from @buildfinancewithjasmine", "@buildfinancewithjasmine.All my expectations has been granted now, I'm so excited seeing my new house today with the help from @buildfinancewithjasmine", "I’m so glad I met someone like you. A good teacher, trader and manager @buildfinancewithjasmine", "I’m so glad I met someone like you. A good teacher, trader and manager @buildfinancewithjasmine", "@buildfinancewithjasmine 🥂🥂🥂🗝", "@buildfinancewithjasmine 🥂🥂🥂🗝", "I just want to thank you for been transparent and honest with your investments process i have enjoyed working with you over the year @buildfinancewithjasmine", "I just want to thank you for been transparent and honest with your investments process i have enjoyed working with you over the year @buildfinancewithjasmine", "@buildfinancewithjasmine\n@buildfinancewithjasmine\n✅✅✅✅✅✅✅✅", "@buildfinancewithjasmine\n@buildfinancewithjasmine\n✅✅✅✅✅✅✅✅", "@buildfinancewithjasmine🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉", "@buildfinancewithjasmine🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉", "@spatola88 il sogno d mia moglia", "@cerci_no no no", "Yass love it!", "I didn’t see the silver skirt! So cute! ❤️", "👏👏🔥", "👏👏👏👏👏👏👏❤️", "@bufalo688176  this fall capsule is everything to us 🫶", "Love these looks! Thanks for the fashion inspo! 🔥😍", "🎭🍟🌍🖇️🌠", "@gonzalolawllc  obsessed with a good ✨ styling ✨ tip", "Love this👏👏👏👏", "@curlsoftheparty our fav fall styles tbh", "Will the denim jumpsuit be restocked?", "@miss_urbanly_unique  all in bio 😘", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "Love this🔥🔥🔥", "this is a whole vibe"]}, "https://www.instagram.com/p/CxWAUZ2OJbl/": {"timestamp": "2023-09-18T18:50:53.000Z", "comments": ["It’s a dream of mine to make a collection with Target 🥹🩷🩷", "So excited for these pieces!!", "@double3xposure  doing backflips rn 👏 😎", "Are you going to be restocking the orange pajamas with the Halloween designs from last year? 😢", "@kjovanya the right mindset to have 👏", "@target  omg 😭🩷", "Lovely collection again ❤️", "Obsessed", "love it ❤️", "So trendy! Love this energy!", "@gonzalolawllc  our fall energy 4 sure", "The best! Love all the @double3xposure pieces. 👌", "Obsessed omg", "@cindydoinstuff this is about to be my whole personality", "I honestly love the future collective line👏👏👏", "Wow!! 🔥🔥😮😮😍😍", "@allaboutthataddie  reese created masterpieces 🤌", "@curlsoftheparty  to be completely honest, same", "🔥🔥😍😍", "@itsamberlouisee"]}, "https://www.instagram.com/p/CxS-EF_OT-R/": {"timestamp": "2023-09-17T14:33:54.000Z", "comments": ["Conchas....ahhhh 🧡🧡🧡", "@estpeac @pmayag 😂", "white people ahh", "Okay I’m going to try these. First I’m buying the book!!! Thanks!!!", "@tinz_17 what a special memory ❤️", "Why", "❤️", "@oeytwinmomma  your taste buds will be thanking you next!", "@bellanashton  so tasty!! 🧡", "Yummy!", "@natalieraesanchez", "Yumi!! ❤️", "@sarasoffffff", "I will have to make some now and then for Thanksgiving morning con cafecito while we wait for the turkey! Thanks for the recipe!", "@joycegonzalez_5  they're so good 🤌", "@mariascinco  that sounds perfect 🧡", "@targetboymoms  i need like 27 of them", "@stina.719", "@target okay. I’ll take the love ❤️", "My good looord😮❤️", "Uuuuuu!!!! 🔥 🎃", "@target", "Omg how cute!!", "Qué tal @helen.b.go ??? Se ven delissss", "@carbon6smami 🔥🔥❤️❤️❤️", "@katee_371 we are their economy!", "@target 12/24 actually for Latinos😬facts", "@target 12/24 actually for Latinos😬facts", "😍🙌🔥", "@katee_371  so much to celebrate!!!", "@ttcita siiii", "nice cuts and color!!! 😍", "😍😍😍", "Wow these look amazing", "Trying to find the receipe. Not having any luck.", "Trying to find the receipe. Not having any luck.", "@target father", "@chicanoeats happy for you.. I love your book 🫶🏼", "cornchas", "Need @bzoltan60 😍", "\"you can totally pick up\"... who talks like this?", "@target clicking the link in the bio and i pressed the link on this picture and says no results found…"]}, "https://www.instagram.com/p/CxLx0ceOg5R/": {"timestamp": "2023-09-14T19:33:30.000Z", "comments": ["@simplyeverydayliving feeling like redoing my entire bedroom rn", "@_theonlyoneza 😍😍yes it’s so gorgeous", "The pillows ❤️❤️❤️", "@liz957 like sleeping on clouds 🤌", "What pillow is in the front?", "I like to go to target and climb the shelves", "Such cute bed", "Love!", "@target why do your plastic bags at checkout stink sooooo bad??? Yuck", "@target What is the name of the sheets??", "Can you share the bed frame link?", "i'd sleep so well here 🤩", "@alexis_whitted  not even a pea will disturb this princess 👑", "@godfather22448  link is in bio!", "Love this look and also this mattress - can you say where from please? @themartinezcasita ❤️", "Loving this!!!🥰 🎯", "Where is the art work from? Thanks", "@0v0angel new bed lewk ~~", "Bed frame link please 🙏🏻", "Please restock the sheets california king sizes 🥲", "@mariafant  loving you ❤️", "Your pricing changes within a manner of hours. I had items in my cart and come back later and the price increases by $5-$8 dollars. Yikes", "That bed 😍🛏️😍🛏️😍🛏️", "@achong1020 same", "Love the top knitted blanket! 😍 I don’t see an exact link though to each item, just to target", "@achong1020 Same here.", "@target Not for this specific frame.", "So cozy ☁️🤩", "love a good layered bed look!", "@casa_de_columbie  in my princess and the pea era", "Link", "Same", "Very cozy", "@margacuellar_interiores___  the perfect bed for those chilly fall evenings", "What a comfy space! 🙌", "@target definitely a good option to dress my next projects 😉", "@gonzalolawllc  all beds should look this comfy and that's my professional opinion", "This looks like the best sleep ever!", "@deliberate.dollar thinking about a nap now", "Love this piece!🫶🫶🫶", "I adore that casaluna blanket at the end of the bed! We just got it and it’s amazing", "Great post check out FH.Treasures.com for more cozy pillows ❤️", "Do you have a link for the large blue green pillows on your bed in this video?"]}, "https://www.instagram.com/p/CxGrMn6ORmM/": {"timestamp": "2023-09-12T19:58:01.000Z", "comments": ["@target 🙌🏼🙌🏼🙌🏼", "This was actually really gross. I don’t recommend unless you have a major sweet tooth. It’s way too much sugar, and the marshmallow taste likes straight plastic.", "this is fantastic @allthingstarget @target  GO ALLIE AND BOO !!!", "🤤🤤🤤", "Oh yummy! Can’t wait to grab one……", "Oh yayyyyyyy 🥳 the best @allthingstarget 🙌🏼🙌🏼🙌🏼 I need to try this. Looks yummy!", "AMAZING 👏🏼", "Open your self checkout registers. They’re always closed in Tracy, CA", "@allthingstarget is the SWEETEST & this dessert looks DELICIOUS 😍👏🏻🫶🏻", "@snapsun", "@0v0angel", "@shehoak we should make videos like this lol", "@randiizaro whaaaatttt 😳😳😳😳 we need this for our Halloween night!!!!", "@_slr2010_ omg yummm!", "Most racist company I have ever worked for.", "@stars_so_high_above  all you gotta do is come my way 🛒", "@steelenutrition_dietitian  a need not a want 👏", "@target haha yes!", "@target_cheer  sweet treats for sweet people 🫶", "@christina_ski23  they taste even MORE amazing if u can believe it 😁", "Unlikely she only went to Target to buy that one item.😂", "@mayem34 yes! 😍", "@targettherapy AGREED 👏", "@pechblosm7 high probability that bag was filled to the brim 😂", "Yum! Adding to my cart on my next @target run 😍", "Where are these?!!!! @paigebrotnov @ashlee_truitt", "@my_happy_place_is_target 🫶", "@target_addictedmama  now that's a plan 👏", "@joanbone27 We adore you Joan! Thanks for the love!", "Running to target rn 💨", "@becksprime run, don't walk 🧡", "@allthingstarget yay!!!", "Um not for $10", "Oh wow that looks so good 🔥🔥", "@loradeanw 😮we need to try this…", "@ashblankley omg!!! Yes!!! Like soon!", "@shilohh.ann @bizzare_star_24 @mad_marmalade", "@jessicaolives you’re my designated brownie-eating boo! I hope you’re ready for this!", "@_hurshini 👻", "@nicoleyoley86 we need this.", "I would not trust that brand . I got sugar cookies from this brand and every piece of cookie I would eat I would find plastic instead . So this looks  good but not going to try this in order to find more plastic", "My boo being my daughter lol.", "@mekaweise  ok, but even better tbh 💕", "So cute and fun!\nAnd thanks for having my OTC med that’s hard to find and not gouging the price.\n✨🎃🙏🎃✨", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "Dessert look DELICIOUS!🤤🤤", "Yeah, I would like it to be much more brownie in it than what it showed!  I really always wonder who they have for quality control taste testers. Clearly the wrong people!!"]}, "https://www.instagram.com/p/Cxd0V_bOHvX/": {"timestamp": "2023-09-21T19:44:47.000Z", "comments": ["HBCU homecoming readyyy 🥳 🩷💜", "@being.bray born ready 💞", "Ready", "Homecoming season is my favorite 🙌🏽", "🔥🔥🔥🔥", "@thejoylavaughn  agreed 🔥", "😍👏👏", "Yasss 🖤🖤🖤", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "Yesss👏👏❤️❤️❤️", "Let’s goooo 🔥 #hbcuhomecoming", "😍😍😍", "@being.bray hbcu pride is aggies do bby", "Love this", "@easysolutiongadgets  let's goooooo", "@cdkonthemic  the HBCU energy is unmatched ⚡", "@keeundra  our favorite time of the year 🔥", "Love that shirt!", "😍😍😍", "@prettyprettynhigel  it's everything 🔥", "Yayyyy! 🎉 Cant wait to see what the HBCU Culture Shop has in store for Homecoming! 🤩 #BlackBeyondMeasure", "@gabby_so_shifty3  no bc same 😍", "@metrobiminneapolismn everything you need for the best time of the year 🫶", "@kaasyana  bringing the energy 🔥❤️", "@thehoneypotco  it's time 🔥", "😍🔥🔥🔥", "🔥 @hbcucultureshop I see you!", "HBCUs up! FAMU up! 🔥🔥🔥", "I love this! I’m going to get my @hbcucultureshop and TLB asap! 😍🔥👏🏾👏🏾👏🏾👏🏾", "@iam_naderah 👏👏👏", "🔥🔥🔥🔥🔥🔥", "The moment we’ve ALL been waiting for. OMG I need EVERYTHING 😍🔥🔥🔥🔥🔥", "@sweetsabs31 @hbcucultureshop 😍🔥🔥", "Nothing like HBCU homecoming season 🙌🏾", "HBCUs run the world of course!", "Yessss for @hbcucultureshop @thelipbar 🔥🔥🔥🔥 2 of my absolute FAVs 🙌🏾", "Cannot WAIT for homecoming season ☺️", "@soartistic17  valid 👏", "❤️❤️❤️🔥🔥🔥", "@stephiebabie 🙌🏾✊🏾 it's HC szn", "@realdealriss 🙌🏾🫶🏾", "@metrobiminneapolismn 🙌🏾🙌🏾🙌🏾", "@yanifnli no Delaware State Merch, smh.", "I absolutely love Target. The owner of Target has shown a deep understanding of his customers and strives to offer a fantastic shopping experience. Their excellent customer service, wide range of organic products, and deals are impressive. I've had such consistently great experiences with Target that if I ever received a bad batch of their products, I wouldn't even bother returning it.", "Ohhhh.....i want my #HBCU gear!😍"]}, "https://www.instagram.com/p/CxOQSs0g6QG/": {"timestamp": "2023-09-15T18:39:13.000Z", "comments": ["@evanemmasmom of course I am what?", "@pics.esh I’ve seen them at Target in the toy isle.", "So cute!!", "I wish they had the guayaberas in adult sizes.", "I love it all🙌", "@a_cut_above_you  that’s going to be you and Maya 💜🤗", "It's all so beautiful 😍", "These are soo prettyyy 😍", "Soooo cute 😍❤️❤️❤️ @xovals__", "@glad_oxana soo adorable$❤❤❤ yes We have one close to our home and the University campus", "@cris_pvd13 Cris, por favor, once you are there take pictures of  goods and prices , or those related to school supplies 😂 target is a wider variety of goods than Chinese miniso", "@evanemmasmom Are you serious?", "@glad_oxana 😂😂😂sure when I get back, bc right now I'm not home lol", "@evanemmasmom sure carol, next month they'll run a promo on mayonnaise", "Wow target that’s awesome. Did you know that September is also #childhoodcancerawareness month. Go gold! Js 🤷‍♀️", "@evanemmasmom right", "❤️❤️❤️", "Love that mug 😍", "How adorable ❤️❤️❤️", "@sarayancy you n cami here soon lol", "😍😍😍😍😍", "@evanemmasmom are u fr😂😂😂", "😂😂😂😂😂", "Can we get a restock on the mini ofrenda? 😢", "@greatproducts022320  you know where to find it 🛒", "@thomas.__fletcher the best kind of target run right here ❤️", "Restock the ceramic ghost with pink pumpkin from Hyde and eek! I've searched 8 targets for it 😢 I wanted him for my dogs memorial table", "So cute! Such simple yet special moments🥰", "@gonzalolawllc  it's the little things ❤️", "The mini cart is soo cute", "@curlsoftheparty only the best for this little 💞", "@eumirellasantos eu gosto mt desse e comprei muitas coisas do enxoval da minha bebê", "I've visited two targets. 1 had a rack of items for Hispanic heritage month no sign or anything and also at the farthest end of the store. My local target not a single display.", "sweet", "@glamoroushomesupply  the most adorable duo 🥹💕", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "😍😍", "Target always delivers on merchandise for Latin Heritage month, unfortunately this year the display at my local store is not up to par. It’s hidden behind a huge Halloween display and Ulta (when it’s usually front and center for the month). Hopefully it can be remedied as there’s no items to purchase for my kiddos.", "Adorable❤️❤️", "Sooooo cute😍", "Sooooooo cute!! ❤️"]}, "https://www.instagram.com/p/CxJmnrHunLf/": {"timestamp": "2023-09-13T23:14:25.000Z", "comments": ["@steelenutrition_dietitian  love u bestie 🫶", "@22taylorswift__ this wait is gonna drive me nuts!", "@reagandorton  i know what's in ur heart 🫶", "@target 🧡🧡🧡🧡🧡🧡", "What about the polaroids?? I wish they came with them.  And I wish her team would bring them back!!😁", "@target thank you 🙏 Target 🎯 I’m a Big Fan of Taylor Swift", "@taylorsversionaccess  the 1989 vibe 🫶", "@the_dawson21 in our 1989 era 🩵", "Is it released yet?", "@targetpops  we're living our wildest dreams 🧡", "So the bonus song isn't on the CD?", "@alwysmaggie  our red lips and rosy cheeks moment ❤️", "@_emrusova not yet, set that calendar for october 27th!", "@zi0n.the.litt.legend  the love is mutual ❤️", "@nurseapril  take it up with miss. swift, i just work here 😌", "@target 💀", "@target  I can’t buy, I’ve been trying since yesterday and it cancels all my orders. I need to know the reason, I’ve already bought on your page before 😭", "how do you pre order???", "WDYM BONUS TRACK?🥹", "already bought the yellow vinyl so sad i’m missing out on the bonus track 🥲", "@lovely_gissel  bonus track 👀", "@ej.morgan  maybe both 🤷‍♀️", "@target you right 😉", "No, this will be in stores as well", "Yes 👍", "its not her version. besides 1989 was released years ago. its just a ploy to make her richer. she doesn't actually care. she's like musk.  she pretends to care about people. she's a narcissist.", "@tobedecided09 okay thank you", "how can I order? I’m from Dubai, UAE\n\nIt’s a NEED!!! 😭 \n\n@target", "@brianbonifacio look at @taylornation 's newest post!", "thank you so much! I found the details on their twitter 😭🫶🏻", "vinyls😍", "Wow", "I will for sure buy it here ❤️", "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "WHAT IS THE EXTRA TRACK????", "Do you deliver in Brazil?", "⭐️", "Already pre-ordered!", "@eden_fiala930  truly smart", "yeah the bonus track is sweeter than fiction (taylor's version). It is revealed on target website.", "I AM CERTAIN TARGET IS GAINING MORE PROFITS!", "Ước gì được @hchi_dn mua cho🙏🏻🌬🕯", "@ghinian__ 🌝", "ITS SWEETER THAN FICTION TV", "I PNLY HAVE A CD PLAYER NOOO😭😭", "Can’t wait to run to target as soon as they open Friday morning ❤️❤️"]}, "https://www.instagram.com/p/Cx8yTN0uVEb/": {"timestamp": "2023-10-03T20:20:05.000Z", "comments": ["🚀🚀🚀", "🚀🚀🚀", "😂😂😂", "@targetredbasket  keeping this video on loop for the foreseeable future 🥹", "So cute will need to take a look!", "Hahaha too funny😂", "Treats for participation! 👏", "This looks like so much fun! 🎉 I love that you can get 30% off Halloween costumes for the family. Your pup looks so adorable in their costume! 🐶", "I would die for Barkley.", "sooooo cute", "😂😂😂😂 love this", "😭🥰💞🎀", "Omg yasssss", "Going by this week!!!", "@amwilliamson85", "My cat should be sponsored by Target. We have all the costumes. 🧡🎃🖤", "We are looking for a Dinosaur costume??", "OMG I need these for my dogs!!😍😍", "@havaladeleon  they'll be the life of the pawty 🐶", "@savvygadgetsboutique dogs in costumes is really a soft spot for us ❤️", "Yay!", "So Cute!! 🐥🍩", "I have a basset hound named Charles Barkley 🥹🥹", "Why don’t we have a doggy daycare in Miami😑", "Our day is made.", "@bodyglide the dog halloween costumes are so important to me personally", "@delightfullydizney  perfect name for a perfect pup 🥹", "@brit7789 they deserve all the treats 🫶", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "🐓", "@target totally get it", "I want to dress my 2 huskies as dalmatians to go with my costume.", "@annabelle_dancer29  we see the vision", "this is everything", "Wish I had a 🐶", "@shopntarget  you can always come visit bullseye ❤️", "@thayers  they are everything", "@steelenutrition_dietitian  you're barking up the right tree 🐶", "@target haha yes", "@target omg blushing"]}, "https://www.instagram.com/p/Cw-6JN9uDtA/": {"timestamp": "2023-09-09T19:35:45.000Z", "comments": ["Yesss drive-up was perfect!", "Also from target! ❤️", "😂 lol perfect!", "Love drive up❤️", "Drive up is so clutch", "You look cute @itsmelmitch !", "Heeeeey!", "Yasss @itsmelmitch look at you 👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "Nope I'll go in and take my time to look around and spend whatever I want lol", "I get distracted on the app too 🤷🏽‍♀️🤷🏽‍♀️😂😂 target knows my heart's desire", "😂😂😂😂😂😂", "@itsmelmitch is so funny! Glad Target is featuring her.", "😍😍😍😍😍", "@itsmelmitch Did you get a secondary urge and then go into the store for some more stuff? 😂 I probably would’ve. 😫🤦🏾‍♂️😅", "I’m still going in after getting my drive up order to check the Bullseye section 😂🎯", "@itsmelmitch GOAT!!", "Yesss drive up 🔥", "😂😂😂😂", "@uncwhlgn  facts right here ^", "@themeryl_com  gotta keep up with that Bullseye section 👀", "@moxiesix  Mel is pure gold ✨", "@moodyjco  i really do, bestie 🫶", "@colormehappyxox  u have my full support 🎯", "@missg2015  easy peasy drive-up squeezy 🚗", "OKAYYYY! Using the target app—but still sneaks in lol", "@kathunder_413  driving up in style fr 🤩", "@whataprecioustime_  ur secret is safe with me 🤫", "🔥🔥🔥", "🤣", "Is the denim from target so cute ❤️. I got to go grab it if so", "Target y'all need to Restock ALL of the Future Collective  pleated midi Dresses & the Skirts! Please & thank you! @target", "I’m just here to show my goodness with Miss @trade_with_danielle_bowman_fx", "When will we start seeing the Hyde and eek merchandiae? Thanks", "Goooooooooo", "@life.is.aeisha thank you!", "I just do delivery… best $99 I’ve ever spent! And most of the shoppers are super nice and will ask if you forgot anything to let them know so they can add it 🎯", "This is so me! However, I tend to oust chase something through the app that was “suggested” too! Target needs to quit having Awesome products!!🫠😂😍"]}, "https://www.instagram.com/p/CxYr_z7O1A3/": {"timestamp": "2023-09-19T19:51:52.000Z", "comments": ["I live on the west coast so online will it be 9 pm 9/22 for me?", "@daniellekrueger", "2am eastern time or @target????", "is Alvvays okay with this? @alvvaysband", "🔥", "We love everything about this outfit! 😍💓", "@clairolcolor  can u imagine it paired with the perfect fall hair color? 👀", "Obsessing over the blazer fit 😍", "@rae.hersey  lives rent-free in our heads ❤️", "Please tell me this will come in a good size range!!!", "Why are the carmin heels only in select stores and not online /: I went to 5 targets gurl 😭", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "So many cute ways to style 😍", "Ooou I love this❤️‍🔥😍", "Day 1 of asking target to bring back the ever springs toilet paper", "What year is this??? 😂", "yooooo what up target 🔥", "What time does it launch on the site?", "🔥", "I love those tall boots are they apart of the collection??", "Dont think we forgot tranbag", "Would love to see these style in plus size options", "Love this!!", "@sarahegomez_ they’re from Wild Fable on Target :) They’re called the Azzahya Stretch Tall Dress Boot 🫶🏼", "@rae.hersey thanks!!", "@curlsoftheparty no", "@gracexfernandez  quickly becoming a fan fave 🍂", "@allaboutthataddie obsessed with this styling ❤️", "It’s giving old school Tommy Hilfiger from the 90’s!!", "@lolo.skye  probably a million", "Striped socks?? 😍🔥", "@target one of the fun things about fashion 🤩😉", "@love_light_laughter11 they're such a vibe", "@c_greene83  oh its giving for sure", "@wildthingsnairplanes Why is it ALWAYS theee MOST BASIC Betty’s that have something to say? I just had to go look at your page and I don’t think you you would understand fashion if it hit you square in the face. Please refrain from speaking on subjects you know nothing about. Focus on being a stay at home mom and wearing dresses from Marshalls and jeans and tshirts. Lol", "Yikes. You sound like a wonderful person. In no way did I put the looks down. It reminds me of when I was in high school. 🤷‍♀️ Good luck in life.", "@curlsoftheparty they have the plus size options online too", "Girl wtf is this 😭", "It sold out by 8am", "🔥🔥🔥", "Cool video! We'll check out the new designs @target ! 🔥🔥🔥", "@target is that mirror at the store too? Clothing selection is ❤️🔥!"]}, "https://www.instagram.com/p/CxBwsa1u6TF/": {"timestamp": "2023-09-10T22:09:20.000Z", "comments": ["I think my invite got lost in the mail 😭😅", "#leaveourchildrenalone", "❤️❤️❤️😍😍", "@shesattarget yours & mine…. But 100% yours 😂🙌", "Absolutely love Target. This is not my favorite.", "I don't know what to say.  You made my life so wonderful and sweet thank you @trade_with_danielle_bowman_fx", "❤️", "@pearlsandparis Lol I wish 😂", "Woooooooooo🔥🙌❤️", "I hope I get a chance to buy something before the shoplifters clear it out. Love these styles!", "Can’t wait 🙌🙌🙌", "Cannot wait to be a model for you one day❤️🎯and rock that runway!", "In. Love. 🫶🏼", "Oh yes 😍😍😍🔥", "does target engage with people this is for a school assignment", "I literally cannot wait to get and style my pieces 🔥🔥🔥🔥🔥🔥", "❤️📌❤️", "Love it all 😍", "Targét social media manager pls look at my most recent post? 🥹❤️", "❤️", "@target is a fake ally.", "Loving some of the new fall pieces I’ve seen at target so far 🙌🙌🙌 I have a few of these already 🤗", "@arizonamanagementlifestyle  we love a fall queen 🍁", "@emoolz_  hope you get an A 💕", "@target NO WAY", "@target PLEASE 🙏 come to Puerto Rico 🇵🇷 your home and clothing collections are amazing… your store is the only one missing here 💖😍", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️🙌❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️"]}, "https://www.instagram.com/p/Cw7-p3Du5Sf/": {"timestamp": "2023-09-08T16:15:13.000Z", "comments": ["#leaveourchildrenalone", "Why no kids/teen sizes in the merch? 😢", "Hey there! 🤗 Im so excited about this exclusive GUTS vinyl and merch! Ill definitely be stopping by Target Westwood to check it out. See you there! 🎉", "Target and I will be there at lyrics to ask you to come over for a while back to them and I will be there at lyrics", "Warren and I will be there at lyrics to the store and get some sleep tonight and I will be there at lyrics", "DMed❤️", "Barton braids to go out and I will be there at lyrics to house sheet with you guys and I will be there at lyrics", "Nothing else to do with me together for a while back to them and I will be there at lyrics to house sheet with you guys and I will be there at lyrics", "Questions about the house and get some sleep tonight and I will be there at lyrics to the store and get some sleep tonight and I will be there at lyrics to", "Hole in the morning and I will be there at lyrics", "COME TO PHILADELPHIA", "When in Utah?", "Can we get some online too? My kid loves this artist and wants the T-shirt ❤️"]}, "https://www.instagram.com/p/CyRVrVdOtw0/": {"timestamp": "2023-10-11T19:59:52.000Z", "comments": ["Blessed by this video bc loteria what? Millennial?! Whaaaat", "Takis & Lotería 😁🙌✨🔥", "@livingwithfab made just for u bestie ✨", "@chidochicago  gotta have the Takis 🔥", "Just a suggestion, I think you should add more breast cancer awareness apparel next year for the month of October, great way to spread awareness.", "@target on my way to Target! 🤠", "Asmr is so annoying 😑", "Thanks for reposting!! 🔥🔥", "Mexican shopper? 🤪", "🥰🥰🥰", "thank you  @ashlil_fox for your outstanding efforts in helping us achieve this significant milestone", "Wow these look soo good and soo fun", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "Look so good", "Yum yum delicious 😋 ❤️❤️❤️", "We give out all these loan just contact us with your information.\n1. Personal Loans\n2. Auto Loans\n3. Student Loans\n4. Mortgage Loans\n5. Home Equity Loans\n6. Credit-Builder Loans\n7. Debt Consolidation Loans\n8. Payday Loans", "The best finds 😍", "target. Explain WHY my order of 2 pumkin embroided square Halloween throw pillows are BACKORDERED 😡😡🤧", "@sjhomedesigns the best finds for the best game night ♠️", "bélico.", "@targetpops what's your fave game night snack? 👀", "Them siete chips are so good!", "@makeithappenwithritz  they're a must-have 🤌", "❤️❤️❤️", "👏👏👏👏"]}, "https://www.instagram.com/p/Cw-YohjO-SU/": {"timestamp": "2023-09-09T14:42:47.000Z", "comments": ["I got 5 grand for the first 20 people to dm me “STRUGGLING ”", "That’s actually cute 😂", "I’m 🅿️aying 💰5,000 to the first seven people to hmu now with “GOD DID” stay blessed y’all 😇💵🦅", "Anyone struggling with bills I’m Paying the first (7) people to HMU with “HELP ME OUT” cus I feel some people going through HARD\nTIMES this month, stay blessed yall", "🎯❤️🙌", "@glowupu 🙏", "This is the third time i am commenting about you ma @traderkristinamsredbrigham I have withdrawn, that’s what I want for you all @traderkristinamsredbrigham", "🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐🌐@traderkristinamsredbrigham", "♥️♥️♥️♥️♥️", "I can’t wait", "What time @targetstyle ?", "I’m so ready for this ! 👏🏽", "Obsessed ❤️❤️", "@jackcarlson 🙌", "I cannot wait!", "I’m personally not a fan of this collection but it does remind me a little of hogwarts 🤣 that I could get behind", "This is perfect for fall 😍💖", "@jackcarlson UBER COOL to see this!", "❤️", "🔥🔥🔥", "Yuck! Not liking this at all", "@alexislovesme  sweater weather takes on a new meaning 🌟", "@__thedani  only a few more days 🤩", "@vivirelsueno_ yes not my favorite", "I don't understand why people like this. Is there a show that goes with this or something?  What am I missing here?", "Love this", "@tracy.coughlin  mark your calendar for 9/23 🗓️❤️"]}, "https://www.instagram.com/p/CxEGuqvuxlX/": {"timestamp": "2023-09-11T20:00:19.000Z", "comments": ["Why can’t we have this level of merch when Taylor releases :/", "@raising_the_joneses lol no you’re not, I’m surprised if anyone over 12 listens to her music", "PLEASE DO THIS FOR TAYLOR SWIFT!!", "I’m very confused what is the smaller vinyl ? I see the vinyl, the cds and then a smaller vinyl on the display  what is it", "they do", "@pariss.bb I know 😭", "@arllop7 we need to check this out 💜", "I’m wearing my guts T-shirt rn while watching this!! Lmao", "Take me thereeeeeeaaaaaaaaaa", "will it cost an arm and a leg?", "GRIFFITHH", "WHAT", "eewww", "i need this …", "COME BACK TO CANADA!!!!!!", "Exactly!!!!", "You do this for olivia and not for taylor? Lmfao", "@carolineee__victoria", "omw rn", "Why target it’s not available in Mexico 😩", "There's no GUTS merch at my Target 😭😤", "Which target was it? Our target didn't have Olivia Merch well 🥺🥺", "NECESITO", "SEND TO 🇧🇷", "Not the biggest fan of Olivia Rodrigo, but that Jean jacket looks nice :0", "Taylor sucks", "@itsjojosiwa no jojo", "@lila_waren omg 😱💜", "Me running to this: 🦵🦵🦵🦵🦵🫶", "Lovvvvvvve", "Why can't they have this when actual good music comes out", "Please tell me the actual vinyl isn't red", "Shout out to target", "Yay 😁 I’m so happy they have guts collection I can’t wait to go and see it 💜", "Necesito", "a shop in cambridge near where i live always has the ‘only at target” version 😭", "I’m going to buy the whole store if they released something Taylor Swift themed", "Ikkkkk!!!", "@sarahthepreppyqueen 😳😳😳", "I need a target in Uruguay or something similar", "@_killle_ mennääks? 😁😁🙏🙏", "Can I get the merch at Mc Allen TX or LaredoTX target?", "@estef_resendiz16 💜", "@friidaa_camacho Vamos", "@friidaa_camacho WOW, vamos por nuestra sudadera 💜", "Only online? Bet"]}, "https://www.instagram.com/p/Cxvjc0YOJuW/": {"timestamp": "2023-09-28T17:00:43.000Z", "comments": ["❤️❤️", "Like a 💎", "@acemm00  we found love", "@samiawillxx", "So only the minis will be at Target or they will have full size products as well", "Y’all don’t hire black men", "@target in a hopeless place 🎤😂", "Wooo", "When will this be in stores my sister has some of this stuff on her wishlist", "Snackable 😍", "Yayyy!!!!", "That’s so exciting!", "Will this be available pnline", "Yasssss 😍", "Ooh, Im so excited for this! Cant wait to check out the mini sets and snack-sized products 🤩", "@metrobiminneapolismn  snack sized is the bestttt", "Don’t even think about taking to long cause it’s hard to move your hands around cause the cops with be on u in seconds", "Can we use target gift cards for ulta products sold in target ?", "STOP PLAYING @target 🩶", "@ultabeauty a sweet treat but make it makeup ❤️", "@vampirecrissy  we can't even believe it 🤩", "👏", "❤️❤️❤️❤️ @target", "Wow u betrayed for Rihanna"]}, "https://www.instagram.com/p/CxgMKVNuaGB/": {"timestamp": "2023-09-22T17:49:13.000Z", "comments": ["@rowingblazers it's really happening 🥹", "@thepixarist  it's the soundtrack to my daydreams ✨", "@sabrinachazen  IT'S HAPPENING 🔥", "Will everything be available in the stores that carry the line or are there some online exclusive styles?", "@jackcarlson  the vibes, the tiny sweaters, i'm so ready 🥹", "@targetredbasket  right? let's gooooo", "I’m so ready!! #AlarmSet #Adds2Cart", "@shamekaearly  hard to pick just one fave tbh", "What time is this gonna be avail on the website??", "Great news! Cant wait to check it out tomorrow. 🤗", "@metrobiminneapolismn  we're SO excited ❤️", "Yessss Target alarm set credit card ready @target", "@_prettygirlkiara alarm set ✅", "@target Why not have all of them!😍", "What time?", "I rarely wake up early but I will be in the store at 8 am! 🛒🏃🏾‍♀️", "😍😍😍OKAYYYY🔥", "Why are best by date (December 2022) snacks still on sale ?", "Yesss ready!!!!!", "Calendar marked!", "Alarm set 🙌", "Got everything I wanted!!!", "Are the kindness sweaters in store? Or are they only sold online?", "I spy @shadesofpinck ❤️❤️", "Sooo exciting!", "Missed out on everything thanks to your 3am EST on sale time. This is so frustrating. It happens everytime.", "Website isn’t working for me on any device 😢", "@morgansite  today's the day!!!", "@phashionphish  let's gooooo", "Snatched some good stuff! I stayed up until midnight for it! 😂", "@chloesena it’s always 3 am ET/12 am PT", "I didn’t c anything at the store!!!!!", "This line is better than Fall Capsule.  Target still needs new buyers. Where is the cute shirts for Halloween and Harvest?\nCome on Target get with the program of cute stuff.", "@ladyjacked no seriously .. 3am is such an awkward time and on a Saturday morning ?! Like we just got through the week and now you want us to wake up by 3am on our days off?! 😂", "@ladyjacked try your local target. I did store pick up at Times Square (don’t know where you located) they had alot in the store.", "@missnoababy I immediately began ordering from local stores 🤣", "@loniquinn 🤗🤗", "I got the pink suit!!! So excited", "Gimme all of the blazers!!!", "@peytoneverafter  how bigs your closet? 👀", "Stay away from our children", "I see pinck and co cute mommy son duo", "I like every thing I’ve received so far. Beautiful collection. Great quality.", "If this isn't cultural appropriation, I don't know what is.", "#unique 🔥🔥🔥"]}, "https://www.instagram.com/p/Cw5o8F_uGb3/": {"timestamp": "2023-09-07T18:29:25.000Z", "comments": ["🎯♥️🙌", "🔥", "🙌", "Love this 😍", "Didn’t get the invite😂 got lost in the mail", "So many mens and childrens items. Little for women.", "😍😍😍", "Thank you @target @greggrippo @paigelorenze @viennaskye! What a night!!!", "THANK YOU @TARGET!!!", "@eatstyleamore  the best way to tide us over until 9/23 🙌", "Yes!!! 😍😍😍", "🙌🙌🙌", "@glassyskinofficial  the enthusiasm this deserves 🙌", "@targetpops  exactly how we feel 😌", "👏", "🔥❤️", "Hello pretty ❤️", "@margaretannreed42267  just in time for that ~crisp~ fall weather", "OMG how COOL is this!!! LOVE 🥰🥰🥰", "What a great night! 🎉 I cant wait to check out the collection on 9/23 - it looks amazing! 🤩", "@dreamboxbeauty so cool 😎", "@metrobiminneapolismn  counting down the days ❤️", "This collection is everything!! Love the preppy feel! 🤗🤍", "🔥🔥🔥", "It’s giving early 2000s Abercrombie & Fitch", "🔥❤️"]}, "https://www.instagram.com/p/Cw5Dv_gO5IG/": {"timestamp": "2023-09-07T13:01:52.000Z", "comments": ["Cute 😍", "❤️❤️", "CONNY!", "This!!!!", "The power Chris and Renee hold is insane", "I’m obsessed!!! Buying all!", "❤️‍🔥 @crystalbpeters", "Victoria fuller and Greg are such slays. 🔥", "❤️❤️", "THANK YOU @TARGET 🙏", "👏👏👏", "@target @rowingblazers KNOWS how to throw a party!!!", "Looks amazing 🔥", "❤️❤️❤️❤️❤️❤️❤️", "KELLY ROWLEGEND!!!!!!\nGARCELLE!!!\nRENEE RAPP!!!!\n\nGarcelle’s boys going the model route with those poses too. #RHOBH always has sibling models lol", "😍", "So glad you’re going to be at our store!!", "@jackiezquan ❤️❤️❤️", "@kayleigh._.gallo  with great power comes great responsibility 😌", "@_cbrams  this collection is gonna fill sooo many carts 🛒", "@justdogsnokids  they were serving 🔥", "This collection colab is 🔥🔥🔥", "🎯♥️🙌", "@tarjaymaxx came here for this comment lol", "@chrisbriney_ @reneerapp @kellyrowland @greggrippo @vlfuller @mradamscott @garcelle @target thank you for being part of an amazing evening! 🙏", "@target 💯", "@cassie_cano that’s his name idc 😂", "@intheory70  i can't get over how cool it is 😎", "Love!!! 👌", "Thank you for having me spin at this incredible collection", "Restock plzzzz!", "@jrocc210  so so excited for this drop ❤️", "@jrocc210 you killed it!", "❤️❤️❤️", "🙂 I myself luv target. Although the only things I buy mostly from there are fashion dolls, candy, soda, novels, and chargers🤭 the @officialrainbowhigh doll aisle is where most people would find me most likely🤪 #adultdollcollector #shopaholic 🛍️", "😍", "Sis this collection looks cute. It comes out the same day as the concert. It’s going to be at Target! @rnmphotographyllc_", "@_flyerthanu sis I gotta check this out na! This is cute!", "@rnmphotographyllc_ right me too sis. I’m going first thing that morning to see it.", "RENEÈ WHAT ARE YOU DOINH HERE??", "Dm me with your cashapp tag or PayPal or Apple Pay ❤️❤️"]}}